{
    "apps": [
        {
            "name": "eye of gnome",
            "desc": "Image viewer for GNOME desktop. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "feh",
            "desc": "Fast, lightweight image viewer that uses imlib2.",
            "category": "General"
        },
        {
            "name": "gnome image viewer",
            "desc": "Simple image viewer for GNOME desktop. Part of gnome.",
            "category": "General"
        },
        {
            "name": "gpicview",
            "desc": "Simple and fast image viewer for X, which is part of the LXDE desktop.",
            "category": "General"
        },
        {
            "name": "gwenview",
            "desc": "Fast and easy to use image viewer for the KDE desktop with optional dependencies for additional format support. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "koko",
            "desc": "Image viewer designed for desktop and touch devices. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "sxiv",
            "desc": "Simple image viewer based on imlib2 that works well with tiling window managers.",
            "category": "General"
        },
        {
            "name": "digikam",
            "desc": "KDE-based image organizer with built-in editing features via a plugin architecture. digiKam asserts it is more full featured than similar applications",
            "category": "General"
        },
        {
            "name": "geeqie",
            "desc": "Image browser and viewer (fork of GQview) that adds additional functionality such as support for RAW files.",
            "category": "General"
        },
        {
            "name": "gnome photos",
            "desc": "Access, organize, and share your photos on GNOME. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "gthumb",
            "desc": "Image viewer and browser for the GNOME desktop.",
            "category": "General"
        },
        {
            "name": "kphotoalbum",
            "desc": "Digital image cataloging software that supports annotation, browsing, searching and viewing of digital images and videos.",
            "category": "General"
        },
        {
            "name": "pix",
            "desc": "Image gallery and image viewer that can be used to open images with other applications like an image editor, add tags to the files, add annotations to",
            "category": "General"
        },
        {
            "name": "shotwell",
            "desc": "A digital photo organizer designed for the GNOME desktop environment",
            "category": "General"
        },
        {
            "name": "dcraw",
            "desc": "Converts many camera RAW formats.",
            "category": "General"
        },
        {
            "name": "g'mic",
            "desc": "Full-featured open-source framework for image processing, providing several different user interfaces to convert/manipulate/filter/visualize generic i",
            "category": "General"
        },
        {
            "name": "graphicsmagick",
            "desc": "Fork of ImageMagick designed to have API and command-line stability. It also supports multi-CPU for enhanced performance and thus is used by some larg",
            "category": "General"
        },
        {
            "name": "imagemagick",
            "desc": "Command-line image manipulation program. It is known for its accurate format conversions with support for over 100 formats. Its API enables it to be s",
            "category": "General"
        },
        {
            "name": "guetzli",
            "desc": "A perceptual JPEG encoder, aiming for excellent compression density at high visual quality.",
            "category": "General"
        },
        {
            "name": "gimp",
            "desc": "Image editing suite in the vein of proprietary editors such as Adobe Photoshop. GIMP (GNU Image Manipulation Program) has been started in the mid 1990",
            "category": "General"
        },
        {
            "name": "gpaint",
            "desc": "Paintbrush clone for GNOME.",
            "category": "General"
        },
        {
            "name": "grafx2",
            "desc": "Bitmap paint program specialized in 256 color drawing.",
            "category": "General"
        },
        {
            "name": "kolourpaint",
            "desc": "Free raster graphics editor for KDE, similar to Microsoft's Paint application before Windows 7, but with some additional features such as support for ",
            "category": "General"
        },
        {
            "name": "krita",
            "desc": "Digital painting and illustration software included based on the KDE platform.",
            "category": "General"
        },
        {
            "name": "mypaint",
            "desc": "Free software graphics application for digital painters.",
            "category": "General"
        },
        {
            "name": "pinta",
            "desc": "Drawing and editing program modeled after Paint.NET. Its goal is to provide a simplified alternative to GIMP for casual users.",
            "category": "General"
        },
        {
            "name": "darktable",
            "desc": "Photography workflow and RAW development application.",
            "category": "General"
        },
        {
            "name": "hugin",
            "desc": "Panorama photo stitcher.",
            "category": "General"
        },
        {
            "name": "lightzone",
            "desc": "Professional-level digital darkroom and photo editor comparable to Photoshop Lightroom.",
            "category": "General"
        },
        {
            "name": "luminance hdr",
            "desc": "Open source graphical user interface application that aims to provide a workflow for HDR imaging.",
            "category": "General"
        },
        {
            "name": "nufraw",
            "desc": "Utility to read and manipulate raw images from digital cameras using DCRaw.",
            "category": "General"
        },
        {
            "name": "rawstudio",
            "desc": "Raw-image converter written in GTK.",
            "category": "General"
        },
        {
            "name": "rawtherapee",
            "desc": "A powerful cross-platform raw image processing program.",
            "category": "General"
        },
        {
            "name": "dia",
            "desc": "GTK-based diagram creation program.",
            "category": "General"
        },
        {
            "name": "diagrams.net",
            "desc": "Diagram drawing application built on web technology. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "figma",
            "desc": "Unofficial desktop application for Figma collaborative design tool. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "inkscape",
            "desc": "Vector graphics editor, with capabilities similar to Illustrator, CorelDraw, or Xara X, using the SVG (Scalable Vector Graphics) file format.",
            "category": "General"
        },
        {
            "name": "karbon",
            "desc": "Vector graphics editor, part of the Calligra Suite. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "libreoffice draw",
            "desc": "Vector graphics editor and diagramming tool included in the LibreOffice suite similar to Microsoft Visio.",
            "category": "General"
        },
        {
            "name": "mockitt",
            "desc": "Proprietary online design, prototyping, and collaboration platform. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "openoffice draw",
            "desc": "Vector graphics editor and diagramming tool included in the OpenOffice suite.",
            "category": "General"
        },
        {
            "name": "pencil project",
            "desc": "GUI prototyping and mockup tool. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "sk1",
            "desc": "Replacement for Adobe Illustrator or CorelDraw, oriented for \"prepress ready\" PostScript & PDF output.",
            "category": "General"
        },
        {
            "name": "yed",
            "desc": "General-purpose proprietary diagramming program for flowcharts, network diagrams, UML diagrams, BPMN diagrams, mind maps, organization charts, and Ent",
            "category": "General"
        },
        {
            "name": "xfig",
            "desc": "Interactive drawing tool.",
            "category": "General"
        },
        {
            "name": "fontforge",
            "desc": "Outline font editor.",
            "category": "General"
        },
        {
            "name": "aseprite",
            "desc": "Open-source software for creating pixel art and animations. Builds can either be purchased from the developers or compiled from source.",
            "category": "General"
        },
        {
            "name": "opentoonz",
            "desc": "2D animation creation software. Gained popularity because it was used by Studio Ghibli in the past.",
            "category": "General"
        },
        {
            "name": "pencil2d",
            "desc": "Easy, intuitive tool to make 2D hand-drawn animations.",
            "category": "General"
        },
        {
            "name": "synfig studio",
            "desc": "2D animation software, designed as powerful industrial-strength solution for creating film-quality animation using a vector and bitmap artwork.",
            "category": "General"
        },
        {
            "name": "tahoma2d",
            "desc": "Free and powerful software for 2D and stop motion animators. Based on OpenToonz",
            "category": "General"
        },
        {
            "name": "tupitube desk",
            "desc": "Desktop application to create and share 2D animations, focused on kids and teenagers.",
            "category": "General"
        },
        {
            "name": "blender",
            "desc": "Fully integrated 3D graphics creation suite capable of 3D modeling, texturing, and animation, among other things.",
            "category": "General"
        },
        {
            "name": "makehuman™",
            "desc": "Parametrical modeling program for creating human bodies.",
            "category": "General"
        },
        {
            "name": "pov-ray",
            "desc": "Script-based raytracer for creating 3D graphics.",
            "category": "General"
        },
        {
            "name": "sweet home 3d",
            "desc": "Interior design software application for the planning and development of floor plans",
            "category": "General"
        },
        {
            "name": "wings 3d",
            "desc": "Advanced subdivision modeler that is both powerful and easy to use.",
            "category": "General"
        },
        {
            "name": "kcolorchooser",
            "desc": "Simple application to select the color from the screen or from a pallete. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "kontrast",
            "desc": "Tool to check contrast for colors that allows verifying that your colors are correctly accessible. Part of kde-accessibility.",
            "category": "General"
        },
        {
            "name": "funkwhale",
            "desc": "self-hosted, modern, free and open-source music server, heavily inspired by Grooveshark. Instances can be federated.",
            "category": "General"
        },
        {
            "name": "music player daemon",
            "desc": "Audio player that has a server-client architecture. In order to interface with it, a separate client is needed.",
            "category": "General"
        },
        {
            "name": "navidrome",
            "desc": "Open source music server and streamer with a built in Web UI. Compatible with a wide range of third-party Android and iOS apps.",
            "category": "General"
        },
        {
            "name": "upmpdcli",
            "desc": "UPnP Media Renderer front-end for Music Player Daemon that interacts with internal streaming services like Gerbera or external streaming services incl",
            "category": "General"
        },
        {
            "name": "cmus",
            "desc": "Very feature-rich ncurses-based music player.",
            "category": "General"
        },
        {
            "name": "davis",
            "desc": "A CLI client for mpd, written in Rust.",
            "category": "General"
        },
        {
            "name": "moc",
            "desc": "Ncurses console audio player with support for the MP3, OGG, and WAV formats.",
            "category": "General"
        },
        {
            "name": "mpg123",
            "desc": "Fast free MP3 console audio player for Linux, FreeBSD, Solaris, HP-UX and nearly all other UNIX systems (also decodes MP1 and MP2 files).",
            "category": "General"
        },
        {
            "name": "clementine",
            "desc": "Amarok 1.4 clone, ported to Qt5. See also Strawberry (below).",
            "category": "General"
        },
        {
            "name": "exaile",
            "desc": "GTK clone of Amarok.",
            "category": "General"
        },
        {
            "name": "gnome audio player",
            "desc": "Audio player for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "gnome music",
            "desc": "Music player for GNOME. It aims to combine an elegant and immersive browsing experience with simple and straightforward controls. Part of gnome.",
            "category": "General"
        },
        {
            "name": "quod libet",
            "desc": "Audio player written with GTK, Python and GStreamer with support for regular expressions in playlists.",
            "category": "General"
        },
        {
            "name": "rhythmbox",
            "desc": "GTK clone of iTunes, used by default in GNOME.",
            "category": "General"
        },
        {
            "name": "amarok",
            "desc": "Mature Qt-based player known for its plethora of features.",
            "category": "General"
        },
        {
            "name": "audacious",
            "desc": "Winamp clone like Beep and old XMMS versions.",
            "category": "General"
        },
        {
            "name": "deadbeef",
            "desc": "Light and fast music player with many features, no GNOME or KDE dependencies, supports console-only, as well as a GTK GUI, comes with many plugins, an",
            "category": "General"
        },
        {
            "name": "elisa",
            "desc": "Simple music player by the KDE community aiming to provide a nice experience for its users. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "goggles music manager",
            "desc": "Music collection manager and player that automatically categorizes your music, supports gapless playback, features easy tag editing, and internet radi",
            "category": "General"
        },
        {
            "name": "juk",
            "desc": "JuK is an audio jukebox application, supporting collections of MP3, Ogg Vorbis, and FLAC audio files. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "museeks",
            "desc": "Minimalistic and easy to use music player. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "qmmp",
            "desc": "Qt-based multimedia player with a user interface that is similar to Winamp or XMMS.",
            "category": "General"
        },
        {
            "name": "vvave",
            "desc": "Tiny Qt music player to keep your favorite songs at hand. Part of maui.",
            "category": "General"
        },
        {
            "name": "audiotube",
            "desc": "YouTube Music client app for phones and desktop computers. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "cider",
            "desc": "An open source and community oriented Apple Music client for Windows, Linux, macOS, and more. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "headset",
            "desc": "Desktop application that turns YouTube into a world class music streaming service. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "nuclear",
            "desc": "Modern music player focused on streaming from free sources. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "pianobar",
            "desc": "Console-based frontend for the online radio Pandora.",
            "category": "General"
        },
        {
            "name": "spotify",
            "desc": "Proprietary music streaming service. It supports local playback and streaming from Spotify's vast library (requires a free account).",
            "category": "General"
        },
        {
            "name": "spotify-tui",
            "desc": "Spotify for the terminal written in Rust. (Project is in hiatus. Does not compile due to several library changes. See Rigellute/spotify-tui #1000)",
            "category": "General"
        },
        {
            "name": "tidal hi-fi (max quality)",
            "desc": "The web version of TIDAL Player running in electron with Hi-Fi (High & Max) support thanks to widevine",
            "category": "General"
        },
        {
            "name": "beets",
            "desc": "Music library organizer, tagger and more.",
            "category": "General"
        },
        {
            "name": "easytag",
            "desc": "Utility for viewing, editing and writing ID3 tags of music files, supports many audio formats.",
            "category": "General"
        },
        {
            "name": "ex falso",
            "desc": "Cross-platform free and open source audio tag editor and library organizer. Run with exfalso.",
            "category": "General"
        },
        {
            "name": "picard",
            "desc": "Cross-platform audio tag editor written in Python (the official MusicBrainz tagger).",
            "category": "General"
        },
        {
            "name": "puddletag",
            "desc": "Replacement for the famous MP3tag for Windows.",
            "category": "General"
        },
        {
            "name": "ecasound",
            "desc": "Command line tools designed for multitrack audio processing. It can be used for simple tasks like audio playback, recording and format conversions, as",
            "category": "General"
        },
        {
            "name": "fre:ac",
            "desc": "Audio converter and CD ripper with support for various popular formats and encoders.",
            "category": "General"
        },
        {
            "name": "sox",
            "desc": "Command line utility that can convert various formats of computer audio files into other formats.",
            "category": "General"
        },
        {
            "name": "audacity",
            "desc": "Program that lets you manipulate digital audio waveforms.",
            "category": "General"
        },
        {
            "name": "gnome sound recorder",
            "desc": "Provides a straight-forward way to record and play audio. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "gwc",
            "desc": "Digital audio editor to denoise, dehiss and amplify audio files.",
            "category": "General"
        },
        {
            "name": "krecorder",
            "desc": "A convergent audio recording application for Plasma. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kwave",
            "desc": "Sound editor for KDE. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "sweep",
            "desc": "Audio editor and live playback tool.",
            "category": "General"
        },
        {
            "name": "wavesurfer",
            "desc": "Tool for sound visualization and manipulation. Typical applications are speech/sound analysis and sound annotation/transcription.",
            "category": "General"
        },
        {
            "name": "ardour",
            "desc": "Multichannel hard disk recorder and digital audio workstation.",
            "category": "General"
        },
        {
            "name": "bitwig studio",
            "desc": "Proprietary professional digital audio workstation.",
            "category": "General"
        },
        {
            "name": "lmms",
            "desc": "Digital audio workstation which allows you to produce music with your computer.",
            "category": "General"
        },
        {
            "name": "muse",
            "desc": "MIDI/Audio sequencer (digital audio workstation) with recording and editing capabilities, aims to be a complete multitrack virtual studio for Linux.",
            "category": "General"
        },
        {
            "name": "qtractor",
            "desc": "Qt-based hard disk recorder and digital audio workstation application that aims to provide digital audio workstation software simple enough for the av",
            "category": "General"
        },
        {
            "name": "reaper",
            "desc": "Proprietary digital audio workstation, offering a full multitrack audio and MIDI recording, editing, processing, mixing and mastering toolset.",
            "category": "General"
        },
        {
            "name": "rosegarden",
            "desc": "Digital audio workstation program developed with ALSA and Qt that acts as an audio and MIDI sequencer, scorewriter and musical composition and editing",
            "category": "General"
        },
        {
            "name": "tracktion waveform",
            "desc": "Proprietary digital audio workstation, specifically designed for the needs of modern music producers.",
            "category": "General"
        },
        {
            "name": "brp-pacu",
            "desc": "Dual channel FFT based acoustic analysis tool to help engineers analyze live professional sound systems using the transfer function.",
            "category": "General"
        },
        {
            "name": "sonic visualiser",
            "desc": "Viewing, analyzing, and annotating the contents of music audio files.",
            "category": "General"
        },
        {
            "name": "canorus",
            "desc": "Music score editor. It supports an unlimited number and length of staffs, polyphony, a MIDI playback of notes, chord markings, lyrics, import/export f",
            "category": "General"
        },
        {
            "name": "impro-visor",
            "desc": "Music notation program designed to help jazz musicians compose and hear solos similar to ones that might be improvised.",
            "category": "General"
        },
        {
            "name": "lilypond",
            "desc": "Music engraving program, devoted to producing the highest-quality sheet music possible.",
            "category": "General"
        },
        {
            "name": "musescore",
            "desc": "Create, playback, and print sheet music.",
            "category": "General"
        },
        {
            "name": "tuxguitar",
            "desc": "Multitrack guitar tablature editor and player.",
            "category": "General"
        },
        {
            "name": "cardinal",
            "desc": "Virtual modular synthesizer plugin based on the VCV Rack, includes lots of virtualized Eurorack modules.",
            "category": "General"
        },
        {
            "name": "chuck",
            "desc": "Strongly-timed, concurrent, and on-the-fly music programming language.",
            "category": "General"
        },
        {
            "name": "csound",
            "desc": "Sound and music computing system.",
            "category": "General"
        },
        {
            "name": "pure data",
            "desc": "Real-time music and multimedia environment.",
            "category": "General"
        },
        {
            "name": "sonic pi",
            "desc": "Code-based music creation and performance tool.",
            "category": "General"
        },
        {
            "name": "supercollider",
            "desc": "Platform for audio synthesis and algorithmic composition, used by musicians, artists, and researchers working with sound.",
            "category": "General"
        },
        {
            "name": "vcv rack",
            "desc": "Virtual Eurorack DAW. Use a plugin systems to add more Eurorack emulated modules.",
            "category": "General"
        },
        {
            "name": "ams",
            "desc": "ALSA Modular Synth. Realtime modular synthesizer and effect processor.",
            "category": "General"
        },
        {
            "name": "amsynth",
            "desc": "Analog Modelling SYNTHesizer. Easy-to-use software synthesizer with a classic subtractive synthesizer topology.",
            "category": "General"
        },
        {
            "name": "din",
            "desc": "Sound synthesizer and musical instrument.",
            "category": "General"
        },
        {
            "name": "fluidsynth",
            "desc": "Real-time software synthesizer based on the SoundFont 2 specifications.",
            "category": "General"
        },
        {
            "name": "hydrogen",
            "desc": "Advanced drum machine to create drum sequences.",
            "category": "General"
        },
        {
            "name": "jsampler",
            "desc": "Java GUI for LinuxSampler software audio sampler.",
            "category": "General"
        },
        {
            "name": "qsampler",
            "desc": "Qt GUI for LinuxSampler software audio sampler.",
            "category": "General"
        },
        {
            "name": "surge xt",
            "desc": "Cross platform, subtractive hybrid synthesizer. Installs the standalone application (surge-xt-standalone), plugins (surge-xt-clap, surge-xt-vst3), and",
            "category": "General"
        },
        {
            "name": "timidity++",
            "desc": "Software synthesizer, which can play MIDI files by converting them into PCM waveform data.",
            "category": "General"
        },
        {
            "name": "yoshimi",
            "desc": "Software synthesizer, a fork of ZynAddSubFX.",
            "category": "General"
        },
        {
            "name": "zynaddsubfx",
            "desc": "Fully featured software synthesizer capable of making a countless number of instruments, from some common heard from expensive hardware to interesting",
            "category": "General"
        },
        {
            "name": "buzztrax",
            "desc": "Music studio to compose songs using only a computer with a soundcard.",
            "category": "General"
        },
        {
            "name": "fasttracker ii",
            "desc": "A clone of the same tracker name using SDL2 in C.",
            "category": "General"
        },
        {
            "name": "milkytracker",
            "desc": "Music application for creating .MOD and .XM module files.",
            "category": "General"
        },
        {
            "name": "openmpt",
            "desc": "Tracker software to create and play back some great music on your computer.",
            "category": "General"
        },
        {
            "name": "protracker 2",
            "desc": "A clone of the original tracker from the amiga. Written using SDL2 in C.",
            "category": "General"
        },
        {
            "name": "mixxx",
            "desc": "Integrates the tools DJs need to perform creative live mixes with digital music files.",
            "category": "General"
        },
        {
            "name": "xwax",
            "desc": "Digital Vinyl System (DVS) for Linux. It allows DJs and turntablists to playback digital audio files (MP3, Ogg Vorbis, FLAC, AAC and more), controlled",
            "category": "General"
        },
        {
            "name": "c.a.v.a.",
            "desc": "Console-based audio visualizer for ALSA, MPD and PulseAudio.",
            "category": "General"
        },
        {
            "name": "projectm",
            "desc": "Music visualizer which uses 3D accelerated iterative image-based rendering.",
            "category": "General"
        },
        {
            "name": "alsamixer",
            "desc": "Soundcard mixer for ALSA soundcard driver, with ncurses interface.",
            "category": "General"
        },
        {
            "name": "kmix",
            "desc": "KDE volume control program. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "volnoti",
            "desc": "A lightweight volume notification daemon for GNU/Linux and other POSIX operating systems.",
            "category": "General"
        },
        {
            "name": "xfce alsa panel plugin",
            "desc": "Simple ALSA volume control plugin for Xfce4 panel.",
            "category": "General"
        },
        {
            "name": "ffplay",
            "desc": "Very simple and portable media player using the FFmpeg libraries and the SDL library. It is mostly used as a testbed for the various FFmpeg APIs.",
            "category": "General"
        },
        {
            "name": "gst-play-1.0",
            "desc": "Simple command line playback testing tool for GStreamer.",
            "category": "General"
        },
        {
            "name": "mplayer",
            "desc": "Video player that supports a complete and versatile array of video and audio formats.",
            "category": "General"
        },
        {
            "name": "mpv",
            "desc": "Movie player based on MPlayer and mplayer2.",
            "category": "General"
        },
        {
            "name": "vlc media player",
            "desc": "Command-line version of the famous video player that can play smoothly high definition videos in the TTY. The  rc interface can be launched with vlc -",
            "category": "General"
        },
        {
            "name": "gnome video player",
            "desc": "Video player for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "movie monad",
            "desc": "Free and simple to use video player made with Haskell using GStreamer and GTK. Precompiled and no Haskell dependency in run-time.",
            "category": "General"
        },
        {
            "name": "pantheon videos",
            "desc": "Video player and library designed for elementary OS using GStreamer.",
            "category": "General"
        },
        {
            "name": "parole",
            "desc": "Modern media player based on the GStreamer framework.",
            "category": "General"
        },
        {
            "name": "rage",
            "desc": "Video and audio player written with Enlightenment Foundation Libraries with some extra bells and whistles. Uses GStreamer",
            "category": "General"
        },
        {
            "name": "totem",
            "desc": "Media player (audio and video) for the GNOME desktop that uses GStreamer.",
            "category": "General"
        },
        {
            "name": "snappy",
            "desc": "Powerful media player with a minimalistic interface that uses GStreamer.",
            "category": "General"
        },
        {
            "name": "spivak",
            "desc": "Karaoke player based on GStreamer and Qt5.",
            "category": "General"
        },
        {
            "name": "baka mplayer",
            "desc": "Free and open source, cross-platform, mpv based multimedia player (Qt 5).",
            "category": "General"
        },
        {
            "name": "celluloid",
            "desc": "Simple GTK frontend for mpv.",
            "category": "General"
        },
        {
            "name": "deepin movie",
            "desc": "Movie player for Deepin desktop based on mpv.",
            "category": "General"
        },
        {
            "name": "haruna video player",
            "desc": "Qt/QML video player built on top of mpv.",
            "category": "General"
        },
        {
            "name": "kawaii-player",
            "desc": "Audio/video manager and multimedia player (based on mpv) with PC-to-PC casting feature, along with functionalities of portable media server and torren",
            "category": "General"
        },
        {
            "name": "minitube",
            "desc": "YouTube desktop application written in C++ using mpv and Qt.",
            "category": "General"
        },
        {
            "name": "mpv",
            "desc": "Very basic GUI for mpv. Can be launched with mpv --player-operation-mode=pseudo-gui.",
            "category": "General"
        },
        {
            "name": "plasmatube",
            "desc": "YouTube video player for KDE based on mpv and yt-dlp. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "smplayer",
            "desc": "Qt multimedia player with extra features (CSS themes, YouTube integration, etc.) based on mpv. It can use MPlayer as alternative backend.",
            "category": "General"
        },
        {
            "name": "xt7-player-mpv",
            "desc": "Qt/Gambas GUI to mpv with a rich set of configurable options including filters and drivers, ladspa plugins support as well as library/playlist managem",
            "category": "General"
        },
        {
            "name": "clip",
            "desc": "Video player and collection manager utilizing FFmpeg as the backend. Part of maui.",
            "category": "General"
        },
        {
            "name": "dragon player",
            "desc": "Simple video player for KDE. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "freetube",
            "desc": "Desktop YouTube player built with privacy in mind. Use YouTube without advertisements and prevent Google from tracking you with their cookies and Java",
            "category": "General"
        },
        {
            "name": "gnome mplayer",
            "desc": "Simple GTK-based GUI for MPlayer.",
            "category": "General"
        },
        {
            "name": "kaffeine",
            "desc": "Very versatile KDE media player that, by default, utilizes VLC as its backend and has excellent support of digital TV (DVB-T, DVB-C, DVB-S).",
            "category": "General"
        },
        {
            "name": "kodi",
            "desc": "Media player and entertainment hub for digital media.",
            "category": "General"
        },
        {
            "name": "qmplay2",
            "desc": "Qt based video player. It can play and stream all formats supported by FFmpeg and libmodplug. It has on integrated module system, which includes a You",
            "category": "General"
        },
        {
            "name": "qtav player",
            "desc": "Simple media player based on QtAV and FFmpeg. Run with Player or QMLPlayer.",
            "category": "General"
        },
        {
            "name": "vlc media player",
            "desc": "Middleweight video player with support for a wide variety of audio and video formats.",
            "category": "General"
        },
        {
            "name": "xine",
            "desc": "Free multimedia player.",
            "category": "General"
        },
        {
            "name": "avidemux cli",
            "desc": "Free video editor designed for simple cutting, filtering and encoding tasks.",
            "category": "General"
        },
        {
            "name": "ffmpeg",
            "desc": "Complete, cross-platform solution to record, convert and stream audio and video.",
            "category": "General"
        },
        {
            "name": "handbrake cli",
            "desc": "Simple yet powerful video transcoder ideal for batch mkv/x264 ripping.",
            "category": "General"
        },
        {
            "name": "mencoder",
            "desc": "Free command line video decoding, encoding and filtering tool.",
            "category": "General"
        },
        {
            "name": "handbrake",
            "desc": "Simple yet powerful video transcoder ideal for batch mkv/x264 ripping. GTK version.",
            "category": "General"
        },
        {
            "name": "avidemux",
            "desc": "Free video editor designed for simple cutting, filtering and encoding tasks.",
            "category": "General"
        },
        {
            "name": "blender",
            "desc": "Fully integrated 3D graphics creation suite with a built-in non-linear video editor.",
            "category": "General"
        },
        {
            "name": "cinelerra (community version)",
            "desc": "Advanced video editing and compositing environment.",
            "category": "General"
        },
        {
            "name": "cinelerra gg infinity",
            "desc": "Professional video editing and compositing environment.",
            "category": "General"
        },
        {
            "name": "davinci resolve",
            "desc": "Proprietary A/V post-production software suite.",
            "category": "General"
        },
        {
            "name": "flowblade",
            "desc": "Multitrack non-linear video editor for Linux, designed to provide a fast, robust editing experience.",
            "category": "General"
        },
        {
            "name": "kdenlive",
            "desc": "Non-linear video editor designed for basic to semi-professional work. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "lightworks",
            "desc": "Professional proprietary non-linear editing system for editing and mastering digital video in various formats.",
            "category": "General"
        },
        {
            "name": "lives",
            "desc": "Video editor and VJ (live performance) platform.",
            "category": "General"
        },
        {
            "name": "losslesscut",
            "desc": "GUI tool for lossless trimming/cutting of video/audio files. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "natron",
            "desc": "Open-source compositing software. Node-graph based. Similar in functionalities to Adobe After Effects and Nuke by The Foundry.",
            "category": "General"
        },
        {
            "name": "openshot",
            "desc": "Non-linear video editor based on MLT framework.",
            "category": "General"
        },
        {
            "name": "pitivi",
            "desc": "Video editor designed to be intuitive and integrate well in the GNOME desktop.",
            "category": "General"
        },
        {
            "name": "shotcut",
            "desc": "Shotcut is a free, open source, cross-platform video editor.",
            "category": "General"
        },
        {
            "name": "aegisub",
            "desc": "Subtitle editor.",
            "category": "General"
        },
        {
            "name": "gnome subtitles",
            "desc": "Video subtitle editor for GNOME.",
            "category": "General"
        },
        {
            "name": "subtitle edit",
            "desc": "Subtitle editing program. Written in C# using mono.",
            "category": "General"
        },
        {
            "name": "gnome network displays",
            "desc": "GTK application to cast your desktop to a remote display. Not specific to the GNOME environment, depends on PipeWire.",
            "category": "General"
        },
        {
            "name": "cheese",
            "desc": "Take photos and videos with your webcam, with fun graphical effects. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "gnome camera",
            "desc": "Take pictures and videos. Part of gnome.",
            "category": "General"
        },
        {
            "name": "guvcview",
            "desc": "Simple interface for capturing and viewing video from v4l2 devices.",
            "category": "General"
        },
        {
            "name": "kamoso",
            "desc": "Webcam recorder from KDE community. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "v4l2loopback",
            "desc": "Kernel module that allows to create virtual video (v4l2) devices. This can be used to create virtual webcams with video passed by programs like FFmpeg",
            "category": "General"
        },
        {
            "name": "devede",
            "desc": "Program to create VideoDVDs and CDs.",
            "category": "General"
        },
        {
            "name": "dvdstyler",
            "desc": "DVD authoring application for the creation of professional-looking DVDs.",
            "category": "General"
        },
        {
            "name": "mythtv",
            "desc": "A homebrew PVR project.",
            "category": "General"
        },
        {
            "name": "tellico",
            "desc": "KDE application for organizing various collections (books, video, music, coins, etc.).",
            "category": "General"
        },
        {
            "name": "emby",
            "desc": "Proprietary media server, which automatically converts and streams your media on-the-fly to play on any device.",
            "category": "General"
        },
        {
            "name": "gerbera",
            "desc": "UPnP Media Server to stream your media to devices on your home network. (Fork of MediaTomb.)",
            "category": "General"
        },
        {
            "name": "icecast",
            "desc": "Streaming media (audio/video) server which currently supports Ogg (Vorbis and Theora), Opus, WebM and MP3 streams.",
            "category": "General"
        },
        {
            "name": "jellyfin",
            "desc": "Media system that puts you in control of managing and streaming your media.",
            "category": "General"
        },
        {
            "name": "owntone",
            "desc": "DAAP (iTunes) and MPD media server with support for AirPlay devices, Apple Remote, Chromecast, Spotify and internet radio.",
            "category": "General"
        },
        {
            "name": "plex",
            "desc": "Proprietary media server, which organizes your personal video, music, and photo collections and streams them to all of your devices.",
            "category": "General"
        },
        {
            "name": "readymedia",
            "desc": "Simple media server software, with the aim of being fully compliant with DLNA/UPnP-AV clients.",
            "category": "General"
        },
        {
            "name": "rygel",
            "desc": "UPnP AV MediaServer and MediaRenderer that allows you to easily share audio, video and pictures, and control of media player on your home network. Par",
            "category": "General"
        },
        {
            "name": "subsonic",
            "desc": "Proprietary media server to stream from your own computer.",
            "category": "General"
        },
        {
            "name": "tvheadend",
            "desc": "TV streaming server and recorder supporting DVB-S, DVB-S2, DVB-C, DVB-T, ATSC, ISDB-T, IPTV, SAT>IP and HDHomeRun as input sources.",
            "category": "General"
        },
        {
            "name": "exiftool",
            "desc": "Command-line application for reading, writing and editing meta information in a wide variety of files.",
            "category": "General"
        },
        {
            "name": "ffprobe",
            "desc": "Gather information from multimedia streams and print it in human- and machine-readable fashion.",
            "category": "General"
        },
        {
            "name": "mediainfo",
            "desc": "Convenient unified display of the most relevant technical and tag data for video and audio files.",
            "category": "General"
        },
        {
            "name": "sndfile-info",
            "desc": "Obtaining information about the contents of an audio file.",
            "category": "General"
        },
        {
            "name": "android file transfer",
            "desc": "Interactive Media Transfer Protocol client with Qt5 GUI.",
            "category": "General"
        },
        {
            "name": "gmtp",
            "desc": "Simple MP3 and media player client for Media Transfer Protocol.",
            "category": "General"
        },
        {
            "name": "gnokii",
            "desc": "Tools and user space driver for use with mobile phones.",
            "category": "General"
        },
        {
            "name": "gtkpod",
            "desc": "GUI for Apple's iPod using GTK. It allows you to import your existing iTunes database, add songs, podcasts, videos and cover art, and to edit ID3 tags",
            "category": "General"
        },
        {
            "name": "kde connect",
            "desc": "Provides integration between devices. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "arpwatch",
            "desc": "Tool that monitors ethernet activity and keeps a database of Ethernet/IP address pairings.",
            "category": "General"
        },
        {
            "name": "dsniff",
            "desc": "Collection of tools for network auditing and penetration testing.",
            "category": "General"
        },
        {
            "name": "etherape",
            "desc": "Graphical network monitor for Unix modeled after etherman. Featuring link layer, IP and TCP modes, it displays network activity graphically. Hosts and",
            "category": "General"
        },
        {
            "name": "ettercap",
            "desc": "Multipurpose Network sniffer/analyser/interceptor/logger.",
            "category": "General"
        },
        {
            "name": "justniffer",
            "desc": "Network protocol analyzer that captures network traffic and produces logs in a customized way, can emulate Apache web server log files, track response",
            "category": "General"
        },
        {
            "name": "netsniff-ng",
            "desc": "High performance Linux network sniffer for packet inspection.",
            "category": "General"
        },
        {
            "name": "ngrep",
            "desc": "grep-like utility that allows you to search for network packets on an interface.",
            "category": "General"
        },
        {
            "name": "nmap",
            "desc": "Security scanner used to discover hosts and services on a computer network, thus creating a \"map\" of the network.",
            "category": "General"
        },
        {
            "name": "ntop",
            "desc": "Network probe that shows network usage in a way similar to what top does for processes.",
            "category": "General"
        },
        {
            "name": "snort",
            "desc": "Network intrusion prevention and detection system.",
            "category": "General"
        },
        {
            "name": "sshguard",
            "desc": "Daemon that protects SSH and other services against brute-force attacks, similar to Fail2ban.",
            "category": "General"
        },
        {
            "name": "suricata",
            "desc": "High performance Network IDS, IPS and Network Security Monitoring engine.",
            "category": "General"
        },
        {
            "name": "tcpdump",
            "desc": "Common console-based packet analyzer that allows the user to intercept and display TCP/IP and other packets being transmitted or received over a netwo",
            "category": "General"
        },
        {
            "name": "vnstat",
            "desc": "Console-based network traffic monitor that keeps a log of network traffic for the selected interfaces.",
            "category": "General"
        },
        {
            "name": "wireshark",
            "desc": "Network protocol analyzer that lets you capture and interactively browse the traffic running on a computer network.",
            "category": "General"
        },
        {
            "name": "xplico",
            "desc": "Network forensics analysis tool (NFAT), which is a software that reconstructs the contents of acquisitions performed with a packet sniffer.",
            "category": "General"
        },
        {
            "name": "lynis",
            "desc": "Security and system auditing tool to harden Unix/Linux systems.",
            "category": "General"
        },
        {
            "name": "metasploit framework",
            "desc": "An advanced open-source platform for developing, testing, and using exploit code.",
            "category": "General"
        },
        {
            "name": "nessus",
            "desc": "Comprehensive vulnerability scanning program.",
            "category": "General"
        },
        {
            "name": "openvas",
            "desc": "Framework of several services and tools offering a comprehensive and powerful vulnerability scanning and vulnerability management solution. FOSS Nessu",
            "category": "General"
        },
        {
            "name": "owasp zap",
            "desc": "Web application security scanner.",
            "category": "General"
        },
        {
            "name": "tiger",
            "desc": "Security tool that can be used both as a security audit and intrusion detection system.",
            "category": "General"
        },
        {
            "name": "tripwire",
            "desc": "Intrusion detection system.",
            "category": "General"
        },
        {
            "name": "aide",
            "desc": "File and directory integrity checker.",
            "category": "General"
        },
        {
            "name": "logwatch",
            "desc": "Customizable log analysis system.",
            "category": "General"
        },
        {
            "name": "clamav",
            "desc": "Open source antivirus engine for detecting trojans, viruses, malware & other malicious threats.",
            "category": "General"
        },
        {
            "name": "rootkit hunter",
            "desc": "Checks machines for the presence of rootkits and other unwanted tools.",
            "category": "General"
        },
        {
            "name": "light-locker",
            "desc": "A simple locker (forked from gnome-screensaver) that aims to have simple, sane, secure defaults and be well integrated with the desktop while not carr",
            "category": "General"
        },
        {
            "name": "slock",
            "desc": "Very simple and lightweight X screen locker. Offers only a black background when locked, there are no animations or text fields.",
            "category": "General"
        },
        {
            "name": "vlock",
            "desc": "TTY locker. A mirror of the original vlock is available at github[dead link 2025-11-17—HTTP 404].",
            "category": "General"
        },
        {
            "name": "xscreensaver",
            "desc": "Screen saver and locker for the X Window System.",
            "category": "General"
        },
        {
            "name": "john the ripper",
            "desc": "Password cracker.",
            "category": "General"
        },
        {
            "name": "1password",
            "desc": "Proprietary tool for 1Password password manager.",
            "category": "General"
        },
        {
            "name": "himitsu",
            "desc": "Secret storage manager.",
            "category": "General"
        },
        {
            "name": "pass",
            "desc": "Simple console-based password manager featuring flat text file organization and GnuPG encryption.",
            "category": "General"
        },
        {
            "name": "vault",
            "desc": "Proprietary tool for managing secrets.",
            "category": "General"
        },
        {
            "name": "figaro's password manager 2",
            "desc": "GTK2 port of Figaro's Password Manager with some new enhancements.",
            "category": "General"
        },
        {
            "name": "kde wallet manager",
            "desc": "Tool to manage the passwords on your system. By using the KDE wallet subsystem, it not only allows you to keep your own secrets but also to access and",
            "category": "General"
        },
        {
            "name": "keepass password safe",
            "desc": "Mono-based password manager, which helps you to manage your passwords in a secure way.",
            "category": "General"
        },
        {
            "name": "keysmith",
            "desc": "OTP generation software by KDE. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "seahorse",
            "desc": "GNOME application for managing encryption keys and passwords in the GNOME Keyring. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "ccrypt",
            "desc": "A command-line utility for encrypting and decrypting files and streams based on Rijndael.",
            "category": "General"
        },
        {
            "name": "gnupg",
            "desc": "The GNU project's complete and free implementation of the OpenPGP standard as defined by RFC4880. Free and Open Source replacement of PGP, mostly used",
            "category": "General"
        },
        {
            "name": "keepassxc",
            "desc": "Mainly used for password management and generation, but also supports attaching arbitrary files to entries in an encrypted database.",
            "category": "General"
        },
        {
            "name": "keybase",
            "desc": "Key directory mapping social media identities, with cross platform encrypted chat, cloud storage, and git repositories.",
            "category": "General"
        },
        {
            "name": "kgpg",
            "desc": "Simple interface for GnuPG, for KDE. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kleopatra",
            "desc": "Certificate Manager and Unified Crypto GUI for KDE. It supports managing X.509 and OpenPGP certificates in the GpgSM keybox and retrieving certificate",
            "category": "General"
        },
        {
            "name": "openssh",
            "desc": "De facto SSH implementation that supports message signing.",
            "category": "General"
        },
        {
            "name": "opgpcard",
            "desc": "CLI tool to inspect, manage and use OpenPGP cards.",
            "category": "General"
        },
        {
            "name": "rsop",
            "desc": "Stateless OpenPGP (SOP) based on rpgp.",
            "category": "General"
        },
        {
            "name": "seahorse",
            "desc": "GNOME application for managing encryption keys and passwords in the GNOME Keyring. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "shig",
            "desc": "CLI utility to create and verify signatures in ssh-keygen(1) § Y compatible format.",
            "category": "General"
        },
        {
            "name": "sq",
            "desc": "A command-line frontend for Sequoia, an implementation of OpenPGP.",
            "category": "General"
        },
        {
            "name": "sqop",
            "desc": "Implementation of the Stateless OpenPGP Interface using Sequoia.",
            "category": "General"
        },
        {
            "name": "argon2",
            "desc": "Key derivation function (KDF) for secure password hashing, resistant to brute-force and side-channel attacks.",
            "category": "General"
        },
        {
            "name": "doas",
            "desc": "A portable version of OpenBSD's doas command, known for being substantially smaller in size compared to sudo while pursuing the same goal of running c",
            "category": "General"
        },
        {
            "name": "pkexec(1)",
            "desc": "A Polkit application that allows an authorized user to run commands or an interactive shell as another user. Configured using Polkit rules.",
            "category": "General"
        },
        {
            "name": "run0",
            "desc": "An alternative invocation of systemd-run(1) to temporarily and interactively acquire elevated or different privileges. Does not rely on SetUID and Set",
            "category": "General"
        },
        {
            "name": "su",
            "desc": "Command used to assume the identity of another user on the system.",
            "category": "General"
        },
        {
            "name": "sudo",
            "desc": "Command to delegate the ability to run commands as root or another user while providing an audit trail.",
            "category": "General"
        },
        {
            "name": "installing",
            "desc": "Please consider  the pkgstats package, which provides a timer that sends a list of the packages installed on your system, along with the architecture ",
            "category": "General"
        },
        {
            "name": "start",
            "desc": "Daemon packages usually include the relevant systemd unit file to ; some packages even include different ones. After installation pacman -Qql package ",
            "category": "General"
        },
        {
            "name": "alternativeto",
            "desc": "Linux alternatives to popular applications",
            "category": "General"
        },
        {
            "name": "awesome linux software",
            "desc": "Collection of Linux applications and tools",
            "category": "General"
        },
        {
            "name": "linux alternative project",
            "desc": "Linux equivalents to Windows software",
            "category": "General"
        },
        {
            "name": "linux links directory",
            "desc": "Linux applications directory",
            "category": "General"
        },
        {
            "name": "open source alternative",
            "desc": "Alternatives to commercial software",
            "category": "General"
        },
        {
            "name": "debian packages",
            "desc": "and screenshots",
            "category": "General"
        },
        {
            "name": "awesome-linuxaudio",
            "desc": "Software for audio/video/live production",
            "category": "General"
        },
        {
            "name": "awesome-selfhosted",
            "desc": "Network services and web applications",
            "category": "General"
        },
        {
            "name": "awesome-shell",
            "desc": "Command-line frameworks, toolkits and guides",
            "category": "General"
        },
        {
            "name": "awesome-sysadmin",
            "desc": "Software for system administrators",
            "category": "General"
        },
        {
            "name": "inconsolation",
            "desc": "Lightweight and minimalist applications reviews",
            "category": "General"
        },
        {
            "name": "k.mandla's blog",
            "desc": "Console applications screenshots and reviews",
            "category": "General"
        },
        {
            "name": "libre projects",
            "desc": "Open source hosted web services",
            "category": "General"
        },
        {
            "name": "linapp",
            "desc": "Commercial applications and games for Linux",
            "category": "General"
        },
        {
            "name": "prism break",
            "desc": "Software against mass surveillance",
            "category": "General"
        },
        {
            "name": "privacy guides",
            "desc": "Ad-Free Privacy Tool/Service Recommendations",
            "category": "General"
        },
        {
            "name": "radicale",
            "desc": "Free and Open-Source CalDAV and CardDAV Server.",
            "category": "General"
        },
        {
            "name": "evolution",
            "desc": "Personal information management application that provides integrated mail, calendaring and address book functionality. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "kontact",
            "desc": "Integrated solution to your personal information management. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "merkuro",
            "desc": "Calendar and contact application that allows you to manage your tasks, events and contacts. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "thunderbird",
            "desc": "A fully featured E-mail client formerly developed by Mozilla.",
            "category": "General"
        },
        {
            "name": "remind",
            "desc": "Highly sophisticated text-based calendaring and notification system.",
            "category": "General"
        },
        {
            "name": "agenda",
            "desc": "Calendar application built with MauiKit. Part of maui.",
            "category": "General"
        },
        {
            "name": "gnome calendar",
            "desc": "Calendar application for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kalarm",
            "desc": "Personal alarm message, command and email scheduler, part of kde-pim.",
            "category": "General"
        },
        {
            "name": "kongress",
            "desc": "Companion application for conferences made by KDE. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "korganizer",
            "desc": "Calendar and scheduling program, part of kde-pim.",
            "category": "General"
        },
        {
            "name": "merkuro calendar",
            "desc": "Calendar application using Akonadi that supports both local and online calendars: Nextcloud, Google Calendar, Outlook, Caldav and more. Part of kde-pi",
            "category": "General"
        },
        {
            "name": "nextcloud calendar",
            "desc": "Calendar app for Nextcloud.",
            "category": "General"
        },
        {
            "name": "gnome clocks",
            "desc": "Clocks application for GNOME, including alarm, stopwatch and timer functionality. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kclock",
            "desc": "A convergent clock application for Plasma. It contains alarm, timer, stopwatch and timezone functionalities. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kteatime",
            "desc": "Handy timer for steeping tea. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "rsi break",
            "desc": "Takes care of your health and regularly breaks your work to avoid repetitive strain injury (RSI) on Xorg.",
            "category": "General"
        },
        {
            "name": "workrave",
            "desc": "Program that assists in the recovery and prevention of RSI on Xorg.",
            "category": "General"
        },
        {
            "name": "francis",
            "desc": "App that uses the well-known pomodoro technique to help you get more productive. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "pomodoro-logger",
            "desc": "Pomodoro timer and logger with Kanban board for task management and tracking.",
            "category": "General"
        },
        {
            "name": "timenaut",
            "desc": "Time tracker that tracks active windows and lets you sort them into categories. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "taskwarrior",
            "desc": "Command-line To-do list application with support for lua customization and more.",
            "category": "General"
        },
        {
            "name": "effitask",
            "desc": "Graphical task manager, based on the Todo.txt format.",
            "category": "General"
        },
        {
            "name": "endeavour",
            "desc": "Personal task manager for GNOME. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "go for it!",
            "desc": "Simple and stylish productivity app, featuring a to-do list, merged with a timer that keeps your focus on the current task. To-do lists are stored in ",
            "category": "General"
        },
        {
            "name": "gtg",
            "desc": "Personal tasks and TODO list items organizer for GNOME inspired by the Getting Things Done (GTD) methodology.",
            "category": "General"
        },
        {
            "name": "nextcloud tasks",
            "desc": "Tasks app for Nextcloud.",
            "category": "General"
        },
        {
            "name": "ptask",
            "desc": "GTK task manager based on Taskwarrior.",
            "category": "General"
        },
        {
            "name": "sleek",
            "desc": "todo.txt app with modern GUI. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "zanshin",
            "desc": "To-do management application for KDE. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "communicator",
            "desc": "Integrated address book and dialer application features the search for and view of contacts, edit contact details, and make new contacts, favorites, a",
            "category": "General"
        },
        {
            "name": "gnome contacts",
            "desc": "Contacts manager for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kaddressbook",
            "desc": "Address book manager for KDE. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "merkuro contacts",
            "desc": "Address book using Akonadi. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "nextcloud contacts",
            "desc": "Contacts app for Nextcloud.",
            "category": "General"
        },
        {
            "name": "phpldapadmin",
            "desc": "LDAP client webapp. Its hierarchical tree-viewer and advanced search functionality make it intuitive to browse and administer your LDAP directory.",
            "category": "General"
        },
        {
            "name": "ledger",
            "desc": "Ledger is a powerful, double-entry accounting system that is accessed from the UNIX command-line.",
            "category": "General"
        },
        {
            "name": "erpnext",
            "desc": "Free and open source Enterprise Resource Planning (ERP).",
            "category": "General"
        },
        {
            "name": "gnucash",
            "desc": "Financial application that implements a double-entry book-keeping system with features for small business accounting.",
            "category": "General"
        },
        {
            "name": "homebank",
            "desc": "Easy to use finance manager that can analyse your personal finance in detail using powerful filtering tools and graphs.",
            "category": "General"
        },
        {
            "name": "kmymoney",
            "desc": "Personal finance manager that operates in a similar way to Microsoft Money. It supports different account types, categorisation of expenses and income",
            "category": "General"
        },
        {
            "name": "odoo",
            "desc": "Open source ERP system purely in Python. Previously known as OpenERP.",
            "category": "General"
        },
        {
            "name": "exodus",
            "desc": "All-in-one proprietary application to secure, manage, and exchange blockchain assets. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "calligra plan",
            "desc": "Project management application, which is intended for managing moderately large projects with multiple resources.",
            "category": "General"
        },
        {
            "name": "ganttproject",
            "desc": "Project scheduling application featuring gantt chart, resource management, calendaring.",
            "category": "General"
        },
        {
            "name": "notion-app",
            "desc": "A note-taking software and project management software that is used for note-taking, task management, project management, knowledge management, and pe",
            "category": "General"
        },
        {
            "name": "projectlibre",
            "desc": "Project management software alternative to Microsoft Project.",
            "category": "General"
        },
        {
            "name": "taskjuggler",
            "desc": "Modern and powerful project management tool. Its new approach to project planning and tracking is more flexible and superior to the commonly used Gant",
            "category": "General"
        },
        {
            "name": "keditbookmarks",
            "desc": "Bookmark organizer and editor. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "recipes",
            "desc": "Recipe management application for GNOME. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "itinerary",
            "desc": "Digital travel assistant with a priority on protecting your privacy. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "artikulate",
            "desc": "Pronunciation trainer that helps improving and perfecting a learner's pronunciation skills for a foreign language. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "kalm",
            "desc": "Teach you different breathing techniques. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "moodle",
            "desc": "Open-source software learning management system.",
            "category": "General"
        },
        {
            "name": "openboard",
            "desc": "Interactive whiteboard software for schools and universities.",
            "category": "General"
        },
        {
            "name": "anki",
            "desc": "Intelligent spaced-repetition memory training program.",
            "category": "General"
        },
        {
            "name": "kwordquiz",
            "desc": "Tool that gives you a powerful way to master new vocabularies. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "mnemosyne",
            "desc": "Flash-card tool which optimizes your learning process.",
            "category": "General"
        },
        {
            "name": "parley",
            "desc": "Program to help you memorize things. It uses the spaced repetition learning method, also known as flash cards. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "ktouch",
            "desc": "Program to learn and practice touch typing. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "espeak ng",
            "desc": "Fork of eSpeak (due to inactivity of original maintainer).",
            "category": "General"
        },
        {
            "name": "festival",
            "desc": "General framework for building speech synthesis systems as well as including examples of various modules. As a whole it offers full text to speech.",
            "category": "General"
        },
        {
            "name": "kmouth",
            "desc": "Speech synthesizer frontend which enables persons that cannot speak to let their computer speak. Part of kde-accessibility.",
            "category": "General"
        },
        {
            "name": "mbrola",
            "desc": "Proprietary phonemes-to-audio program which supports more than 70 languages. Mbrola-voices can also be used with eSpeak.",
            "category": "General"
        },
        {
            "name": "orca",
            "desc": "Screen reader for individuals who are blind or visually impaired, using eSpeak (via Speech Dispatcher). Part of gnome.",
            "category": "General"
        },
        {
            "name": "rhvoice",
            "desc": "Cross-platform (including Android) text-to-speech from a blind Russian-speaking developer, based on HTS (ru, ka, uk, ky, tt, en, pt, eo)",
            "category": "General"
        },
        {
            "name": "sops",
            "desc": "Provides a simple way to write custom plugins for screen reader Orca.",
            "category": "General"
        },
        {
            "name": "speech dispatcher",
            "desc": "Common interface to speech synthesis. It has backends for eSpeak, Festival, and a few other speech synthesizers.",
            "category": "General"
        },
        {
            "name": "julius",
            "desc": "Large vocabulary continuous speech recognition engine.",
            "category": "General"
        },
        {
            "name": "kaldi",
            "desc": "Speech recognition toolkit.",
            "category": "General"
        },
        {
            "name": "mycroft",
            "desc": "Hackable voice assistant.",
            "category": "General"
        },
        {
            "name": "kmag",
            "desc": "Small KDE utility to magnify a part of the screen. Part of kde-accessibility.",
            "category": "General"
        },
        {
            "name": "kmousetool",
            "desc": "Clicks the mouse whenever the mouse cursor pauses briefly. It was designed to help those with repetitive strain injuries, for whom pressing buttons hu",
            "category": "General"
        },
        {
            "name": "cairo-dock",
            "desc": "Highly customizable dock and launcher application.",
            "category": "General"
        },
        {
            "name": "lxqt panel",
            "desc": "Qt-based taskbar, part of the LXQt desktop.",
            "category": "General"
        },
        {
            "name": "xfce panel",
            "desc": "Panel included in the Xfce desktop.",
            "category": "General"
        },
        {
            "name": "dash to panel",
            "desc": "A fully customizable icon taskbar for gnome-shell. Moves the dash into the GNOME main panel, similar to KDE Plasma and Windows 10.",
            "category": "General"
        },
        {
            "name": "bmpanel",
            "desc": "Lightweight, NETWM compliant panel.",
            "category": "General"
        },
        {
            "name": "fbpanel",
            "desc": "Lightweight, NETWM compliant desktop panel.",
            "category": "General"
        },
        {
            "name": "gnome panel",
            "desc": "Panel included in the GNOME Flashback desktop.",
            "category": "General"
        },
        {
            "name": "lemonbar",
            "desc": "A featherweight status bar based on XCB. Provides UTF-8 support, background and foreground colors, text alignment, and not much more.",
            "category": "General"
        },
        {
            "name": "lxpanel",
            "desc": "Lightweight X11 desktop panel and part of the LXDE desktop.",
            "category": "General"
        },
        {
            "name": "mate panel",
            "desc": "Panel included in the MATE desktop.",
            "category": "General"
        },
        {
            "name": "plank",
            "desc": "Elegant, simple, clean dock from Pantheon desktop environment.",
            "category": "General"
        },
        {
            "name": "polybar",
            "desc": "A fast and easy-to-use tool for creating status bars.",
            "category": "General"
        },
        {
            "name": "tint2",
            "desc": "Simple panel/taskbar developed specifically for Openbox.",
            "category": "General"
        },
        {
            "name": "xmobar",
            "desc": "A lightweight, text-based, status bar written in Haskell.",
            "category": "General"
        },
        {
            "name": "stalonetray",
            "desc": "Stand-alone freedesktop.org and KDE system tray (notification area) for Xorg. It has full XEMBED support and minimal dependencies: an X11 lib only. St",
            "category": "General"
        },
        {
            "name": "cbatticon",
            "desc": ": battery",
            "category": "General"
        },
        {
            "name": "volumeicon",
            "desc": ": volume",
            "category": "General"
        },
        {
            "name": "pasystray",
            "desc": ": pulseaudio",
            "category": "General"
        },
        {
            "name": "sbxkb",
            "desc": "AUR: keyboard layout",
            "category": "General"
        },
        {
            "name": "python-pystray",
            "desc": ": Python library for creating tray entries.",
            "category": "General"
        },
        {
            "name": "tktray",
            "desc": "AUR: Tk extension to create system tray icons following XDG specifications.",
            "category": "General"
        },
        {
            "name": "dmenu",
            "desc": "Fast and lightweight dynamic menu for X which is also useful as an application launcher.",
            "category": "General"
        },
        {
            "name": "gmrun",
            "desc": "Lightweight GTK-based application launcher, with the ability to run programs inside a terminal and other handy features.",
            "category": "General"
        },
        {
            "name": "gnome games",
            "desc": "GNOME application to browse your local video games library and to easily pick and play a game from it. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "launchy",
            "desc": "Very popular cross-platform application launcher with a plugin-based system used to provide extra functionality.",
            "category": "General"
        },
        {
            "name": "rofi",
            "desc": "Popup window switcher roughly based on superswitcher, requiring only xlib and pango.",
            "category": "General"
        },
        {
            "name": "tofi",
            "desc": "Tiny dynamic menu, fast and simple dmenu/rofi replacement for Wayland compositors such as sway.",
            "category": "General"
        },
        {
            "name": "wofi",
            "desc": "GTK-based popup window switcher for Wayland compositors such as sway. Inspired by rofi.",
            "category": "General"
        },
        {
            "name": "alacarte",
            "desc": "Add or remove applications from the main menu.",
            "category": "General"
        },
        {
            "name": "kmenuedit",
            "desc": "Edit one of the KDE application launchers. Part of plasma.",
            "category": "General"
        },
        {
            "name": "xdg-menu",
            "desc": "Generate XDG application menus for various window managers.",
            "category": "General"
        },
        {
            "name": "feh",
            "desc": "A lightweight and powerful image viewer that can also be used to manage the desktop wallpaper.",
            "category": "General"
        },
        {
            "name": "nitrogen",
            "desc": "A fast and lightweight desktop background browser and setter for X windows.",
            "category": "General"
        },
        {
            "name": "xlivebg",
            "desc": "A live wallpaper framework and collection of live wallpapers for the X window system.",
            "category": "General"
        },
        {
            "name": "bbpager",
            "desc": "Dockable pager for blackbox and other window managers.",
            "category": "General"
        },
        {
            "name": "gdesklets",
            "desc": "System for bringing mini programs (desklets) onto your desktop.",
            "category": "General"
        },
        {
            "name": "kruler",
            "desc": "Displays on screen a ruler measuring pixels. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "oblogout",
            "desc": "Openbox logout script",
            "category": "General"
        },
        {
            "name": "orange",
            "desc": "Visual programming toolkit for data mining, ML and interactive visualization.",
            "category": "General"
        },
        {
            "name": "prolog",
            "desc": "Logic-programming language for symbolic AI and computational linguistics.",
            "category": "General"
        },
        {
            "name": "pytorch",
            "desc": "Dynamic neural-network framework with strong GPU acceleration.",
            "category": "General"
        },
        {
            "name": "tensorflow",
            "desc": "End-to-end platform for scalable machine learning.",
            "category": "General"
        },
        {
            "name": "theano",
            "desc": "Python library for efficient multi-dimensional array math and deep learning.",
            "category": "General"
        },
        {
            "name": "torch",
            "desc": "Scientific computing & ML framework for LuaJIT.",
            "category": "General"
        },
        {
            "name": "llama.cpp",
            "desc": "A high-performance C/C++ port of Facebook's LLaMA model, optimized for local execution.",
            "category": "General"
        },
        {
            "name": "ollama",
            "desc": "A streamlined tool for creating, running, and sharing large language models locally.",
            "category": "General"
        },
        {
            "name": "mycroft",
            "desc": "Intelligent personal assistant and knowledge navigator with speech recognition.",
            "category": "General"
        },
        {
            "name": "bc",
            "desc": "Arbitrary precision calculator language.",
            "category": "General"
        },
        {
            "name": "genius",
            "desc": "Advanced calculator including a mathematical programming language.",
            "category": "General"
        },
        {
            "name": "gnome calculator",
            "desc": "Scientific calculator included in the GNOME desktop. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kalgebra",
            "desc": "Calculator and 3D plotter. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "kalk",
            "desc": "A convergent calculator application built with the Kirigami framework. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kcalc",
            "desc": "Scientific calculator included in the KDE desktop. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "xcalc",
            "desc": "Scientific calculator for X with algebraic and reverse polish notation modes.",
            "category": "General"
        },
        {
            "name": "axiom",
            "desc": "FriCAS: derivative of the powerful AXIOM-CAS.",
            "category": "General"
        },
        {
            "name": "gap",
            "desc": "Computer algebra system for computational discrete algebra with particular emphasis on computational group theory.",
            "category": "General"
        },
        {
            "name": "maple",
            "desc": "Famous commercial CAS. Often used in education.",
            "category": "General"
        },
        {
            "name": "mathics",
            "desc": "A free CAS for symbolic mathematical computations which uses Python as its main language. It aims at achieving a Mathematica-compatible syntax and fun",
            "category": "General"
        },
        {
            "name": "mathomatic",
            "desc": "General purpose Computer Algebra System written in C.",
            "category": "General"
        },
        {
            "name": "maxima",
            "desc": "Maple/Mathematica-like computer algebra system.",
            "category": "General"
        },
        {
            "name": "pari/gp",
            "desc": "Computer algebra system designed for fast computations in number theory.",
            "category": "General"
        },
        {
            "name": "singular",
            "desc": "Computer algebra system for polynomial computations, with special emphasis on commutative and non-commutative algebra, algebraic geometry, and singula",
            "category": "General"
        },
        {
            "name": "xcas",
            "desc": "User interface to Giac, a free, basic computer algebra system.",
            "category": "General"
        },
        {
            "name": "graphviz",
            "desc": "The established tool for displaying smallish graphs in 2D.",
            "category": "General"
        },
        {
            "name": "cadabra",
            "desc": "A field-theory motivated approach to computer algebra.",
            "category": "General"
        },
        {
            "name": "cantor",
            "desc": "Application that lets you use your favorite mathematical applications from within a nice KDE-integrated Worksheet Interface. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "fftw",
            "desc": "A Fast Fourier Transform library for computing discrete Fourier transforms. Used for a wide variety of numerical applications, which includes spectral",
            "category": "General"
        },
        {
            "name": "freemat",
            "desc": "Matlab-like program that supports many of its functions and features a codeless interface to external C, C++, and Fortran code, further parallel distr",
            "category": "General"
        },
        {
            "name": "geogebra",
            "desc": "Dynamic mathematics software with interactive graphics, algebra and spreadsheet",
            "category": "General"
        },
        {
            "name": "julia",
            "desc": "High-level, high-performance dynamic language for technical computing.",
            "category": "General"
        },
        {
            "name": "kig",
            "desc": "Application for Interactive Geometry. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "matplotlib (pylab)",
            "desc": "Collection of Python modules (pyplot, numpy, etc.) used for scientific calculations.",
            "category": "General"
        },
        {
            "name": "octave",
            "desc": "MATLAB-like language and interface for numerical computations.",
            "category": "General"
        },
        {
            "name": "sagemath",
            "desc": "Mathematics software system, that combines many existing open-source packages into a common Python interface. Alternative to Magma, Maple, Mathematica",
            "category": "General"
        },
        {
            "name": "scilab",
            "desc": "Matlab alternative used for numerical computations. Its syntax is not equivalent to that of Matlab, but it can be easily converted.",
            "category": "General"
        },
        {
            "name": "gretl",
            "desc": "A cross-platform software package for econometric analysis, written in the C programming language.",
            "category": "General"
        },
        {
            "name": "jamovi",
            "desc": "Statistics package, which is easy to use, and designed to be familiar to users of SPSS. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "pspp",
            "desc": "Free SPSS implementation.",
            "category": "General"
        },
        {
            "name": "r",
            "desc": "Software environment for statistical computing and graphics.",
            "category": "General"
        },
        {
            "name": "rkward",
            "desc": "Frontend for the statistical language R.",
            "category": "General"
        },
        {
            "name": "rstudio",
            "desc": "A powerful and productive IDE for R written in Qt.",
            "category": "General"
        },
        {
            "name": "alphaplot",
            "desc": "Application for scientific data analysis and visualization, fork of SciDAVis / QtiPlot.",
            "category": "General"
        },
        {
            "name": "fityk",
            "desc": "Curve fitting and data analysis application, predominantly used to fit analytical, bell-shaped functions to experimental data.",
            "category": "General"
        },
        {
            "name": "gnuplot",
            "desc": "Command-line program that can generate 2D and 3D plots of functions, data, and data fits.",
            "category": "General"
        },
        {
            "name": "grace",
            "desc": "WYSIWYG 2D graph plotting tool.",
            "category": "General"
        },
        {
            "name": "kmplot",
            "desc": "Program to draw graphs, their integrals or derivatives. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "kst",
            "desc": "Real-time data viewer.",
            "category": "General"
        },
        {
            "name": "labplot",
            "desc": "Free software data analysis and visualization application, similar to SciDAVis.",
            "category": "General"
        },
        {
            "name": "rocs",
            "desc": "Graph Theory IDE for everybody interested in designing and analyzing graph algorithms (e.g., lecturers, students, researchers). Part of kde-education.",
            "category": "General"
        },
        {
            "name": "root",
            "desc": "Data analysis program and library (originally for particle physics) developed by CERN.",
            "category": "General"
        },
        {
            "name": "agda",
            "desc": "Dependently typed functional programming language and proof assistant. It is an interactive system for writing and checking proofs.",
            "category": "General"
        },
        {
            "name": "rocq",
            "desc": "Formal proof management system. It provides a formal language to write mathematical definitions, executable algorithms and theorems together with an e",
            "category": "General"
        },
        {
            "name": "isabelle",
            "desc": "Generic proof assistant that allows mathematical formulas to be expressed in a formal language and provides tools for proving those formulas in a logi",
            "category": "General"
        },
        {
            "name": "lean theorem prover",
            "desc": "Proof assistant developed principally by Leonardo de Moura at Microsoft Research, used in conjunction with the Lean mathematical library.",
            "category": "General"
        },
        {
            "name": "calculix",
            "desc": "A three-dimensional structural finite element program.",
            "category": "General"
        },
        {
            "name": "elmer_fem_solver",
            "desc": "Finite element analysis (FEA/FEM) software for multiphysics problems. Includes models for fluid dynamics, structural mechanics, electromagnetics, heat",
            "category": "General"
        },
        {
            "name": "fenics",
            "desc": "An open-source computing platform for solving partial differential equations, enabling users to quickly translate scientific models into efficient fin",
            "category": "General"
        },
        {
            "name": "onelab/gmsh",
            "desc": "An open-source, lightweight interface to finite element software, by default containing the mesh generator Gmsh, the finite element solver GetDP and t",
            "category": "General"
        },
        {
            "name": "openfoam",
            "desc": "Software package and toolkit for computational fluid dynamics (CFD).",
            "category": "General"
        },
        {
            "name": "step",
            "desc": "Two-dimensional physics simulation engine. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "swmm",
            "desc": "Storm Water Management Model is a dynamic rainfall-runoff-subsurface runoff simulation model used for simulation of the surface/subsurface hydrology q",
            "category": "General"
        },
        {
            "name": "fend",
            "desc": "An arbitrary-precision unit-aware calculator.",
            "category": "General"
        },
        {
            "name": "numbat",
            "desc": "Statically typed programming language for scientific computations with first class support for physical dimensions and units.",
            "category": "General"
        },
        {
            "name": "units",
            "desc": "Command-line unit converter and calculator that can handle multiplicative scale changes, nonlinear conversions such as Fahrenheit to Celsius or wire g",
            "category": "General"
        },
        {
            "name": "tccalc",
            "desc": "A basic CLI Chemical thermodynamics calculator. Allows for calculating delta S and H of reactions/state changes.",
            "category": "General"
        },
        {
            "name": "avogadro",
            "desc": "Editor, viewer and simulator for 3D molecule structures (also supports downloading files from the Protein Data Bank).",
            "category": "General"
        },
        {
            "name": "ghemical",
            "desc": "Computational chemistry software package used to edit, view and simulate molecular structures.",
            "category": "General"
        },
        {
            "name": "pymol",
            "desc": "Open-source molecular visualization system that can produce high quality 3D images of small molecules and biological macromolecules, such as proteins.",
            "category": "General"
        },
        {
            "name": "ucsf chimera",
            "desc": "Extensible molecular modeling system.",
            "category": "General"
        },
        {
            "name": "vmd",
            "desc": "VMD is a molecular visualization program for displaying, animating, and analyzing large biomolecular systems using 3-D graphics and built-in scripting",
            "category": "General"
        },
        {
            "name": "ambertools",
            "desc": "AmberTools consists of several independently developed packages that work well by themselves, and with Amber18 itself. The suite can also be used to c",
            "category": "General"
        },
        {
            "name": "apbs",
            "desc": "Electrostatic and solvation properties for complex molecules.",
            "category": "General"
        },
        {
            "name": "copasi",
            "desc": "COmplex PAthway SImulator for analysis of biochemical networks and their dynamics.",
            "category": "General"
        },
        {
            "name": "cp2k",
            "desc": "A quantum chemistry and solid state physics software package.",
            "category": "General"
        },
        {
            "name": "lammps",
            "desc": "Large-scale Atomic/Molecular Massively Parallel Simulator.",
            "category": "General"
        },
        {
            "name": "modeller",
            "desc": "3D structure homology modeller.",
            "category": "General"
        },
        {
            "name": "namd",
            "desc": "NAMD is a parallel molecular dynamics code designed for high-performance simulation of large biomolecular systems.",
            "category": "General"
        },
        {
            "name": "nwchem",
            "desc": "Ab initio computational chemistry software package.",
            "category": "General"
        },
        {
            "name": "open babel",
            "desc": "A library designed to interconvert between many file formats used in molecular modeling and computational chemistry.",
            "category": "General"
        },
        {
            "name": "orca",
            "desc": "ORCA is an ab initio, DFT, and semi-empirical SCF-MO package.",
            "category": "General"
        },
        {
            "name": "pdb2pqr",
            "desc": "Electrostatic and solvation properties for complex molecules.",
            "category": "General"
        },
        {
            "name": "plumed",
            "desc": "An open source plugin for free energy calculations in molecular systems which works together with some of the most popular molecular dynamics engines.",
            "category": "General"
        },
        {
            "name": "quantum espresso",
            "desc": "Integrated suite of applications for electronic-structure calculations and materials modeling at nanoscale. It is based on density-functional theory, ",
            "category": "General"
        },
        {
            "name": "rdkit",
            "desc": "A collection of cheminformatics and machine-learning software written in C++ and Python.",
            "category": "General"
        },
        {
            "name": "rdock",
            "desc": "A fast, versatile and open-source program for docking ligands to proteins and nucleic acids.",
            "category": "General"
        },
        {
            "name": "smina",
            "desc": "Smina is a fork of Autodock Vina that focuses on improving scoring and minimization.",
            "category": "General"
        },
        {
            "name": "xdrfile",
            "desc": "Allows to read GROMACS trr and xtc files and also to convert from one format to another.",
            "category": "General"
        },
        {
            "name": "kalzium",
            "desc": "Periodic table of the elements with molecule editor and equation solver. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "gnome maps",
            "desc": "A simple map client for GNOME with navigation and GNSS features (adapted to Linux Mobile). Part of gnome.",
            "category": "General"
        },
        {
            "name": "marble",
            "desc": "Virtual Globe and World Atlas that can be used to learn more about the Earth. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "ktrip",
            "desc": "Public transport assistant for mobile devices. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "gpsd",
            "desc": "Service daemon that monitors one or more GPSes or AIS receivers attached to a host computer through serial or USB ports, making all data on the locati",
            "category": "General"
        },
        {
            "name": "subsurface",
            "desc": "Diving logbook to keep track of your dives by logging dive locations (with GPS coordinates), weights and exposure protection used, divemasters and div",
            "category": "General"
        },
        {
            "name": "grass gis",
            "desc": "Geospatial data management and analysis, image processing, graphics/maps production, spatial modeling and visualization.",
            "category": "General"
        },
        {
            "name": "gvsig",
            "desc": "vSIG is a geographic information system (GIS), that is, a desktop application designed for capturing, storing, handling, analyzing and deploying any k",
            "category": "General"
        },
        {
            "name": "qgis",
            "desc": "Geographic Information System (GIS) that supports vector, raster & database formats.",
            "category": "General"
        },
        {
            "name": "gnome weather",
            "desc": "Small application for GNOME that allows you to monitor the current weather conditions for your city, or anywhere in the world, and to access updated f",
            "category": "General"
        },
        {
            "name": "kweather",
            "desc": "A convergent weather application for Plasma. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "wttr",
            "desc": "A simple console application to check the weather, using data from https://wttr.in",
            "category": "General"
        },
        {
            "name": "siril",
            "desc": "Siril is a software application for astrophotography, which allows pre-processing and processing of images from any type of camera (CCD, planetary cam",
            "category": "General"
        },
        {
            "name": "astropy",
            "desc": "The Astropy Project is a community effort to develop a common core package for Astronomy in Python and foster an ecosystem of interoperable astronomy ",
            "category": "General"
        },
        {
            "name": "pywwt",
            "desc": "Is the official toolkit for accessing AAS WorldWide Telescope (WWT) from Python",
            "category": "General"
        },
        {
            "name": "celestia",
            "desc": "3D astronomy simulation program that allows users to travel through an extensive universe, modeled after reality, at any speed, in any direction and a",
            "category": "General"
        },
        {
            "name": "kstars",
            "desc": "Planetarium application that provides an accurate graphical simulation of the night sky, from any location on Earth, at any date and time. It is inclu",
            "category": "General"
        },
        {
            "name": "skychart / cartes du ciel",
            "desc": "Planetarium that maps out and labels most of the constellations, planets, and objects you can see with a telescope. It can also download Digitized Sky",
            "category": "General"
        },
        {
            "name": "stellarium",
            "desc": "Beautiful 3D planetarium that uses OpenGL to render a realistic sky in real time.",
            "category": "General"
        },
        {
            "name": "xephem",
            "desc": "Motif-based ephemeris and planetarium program.",
            "category": "General"
        },
        {
            "name": "biopython",
            "desc": "Python package with tools for computational biology, as well as bioinformatics.",
            "category": "General"
        },
        {
            "name": "mummer",
            "desc": "Bioinformatics software system for sequence alignment based on suffix trees.",
            "category": "General"
        },
        {
            "name": "ugene",
            "desc": "Application that integrates dozens of well-known biological tools and algorithms, providing both graphical user and command-line interfaces.",
            "category": "General"
        },
        {
            "name": "gramps",
            "desc": "Genealogy program, which helps you track your family tree.",
            "category": "General"
        },
        {
            "name": "lifelines",
            "desc": "Text based genealogy software for family trees and reports.",
            "category": "General"
        },
        {
            "name": "fiji",
            "desc": "ImageJ2AUR distribution with a lot of plugins organized into a coherent menu structure.",
            "category": "General"
        },
        {
            "name": "imagej",
            "desc": "Java-based image processing and analysing program that provides extensibility via plugins and macros. It is widely used in microscopy (e.g. for cell c",
            "category": "General"
        },
        {
            "name": "3dslicer",
            "desc": "Comprehensive MRI, CT, LSCM microscopy volume processing, segmentation and 3D-reconstruction",
            "category": "General"
        },
        {
            "name": "paraview",
            "desc": "Interactive data visualization tool built using VTK that can scale across distributed computer hardware.",
            "category": "General"
        },
        {
            "name": "brl-cad",
            "desc": "Constructive solid geometry modeling CAD system that includes an interactive geometry editor, ray tracing support for graphics rendering and geometric",
            "category": "General"
        },
        {
            "name": "freecad",
            "desc": "Parametric 3D CAD modeler based on OpenCascade, Coin3D, Qt, and Python with features such as macro recording, workbenches and the ability to run as a ",
            "category": "General"
        },
        {
            "name": "librecad",
            "desc": "A 2D CAD application based on Qt5. Forked from QCAD Community Edition.",
            "category": "General"
        },
        {
            "name": "openscad",
            "desc": "A 3D CAD modeler that uses a textual, programmatic approach to creating and manipulating objects.",
            "category": "General"
        },
        {
            "name": "qcad",
            "desc": "A 2D CAD application based on Qt. Supports the DFX and HPGL standard file formats, and optionally the DWG format through a proprietary plugin.",
            "category": "General"
        },
        {
            "name": "solvespace",
            "desc": "Powerful 3D CAD constraint-based parametric modeler with simple mechanical simulation capabilities.",
            "category": "General"
        },
        {
            "name": "cura",
            "desc": "Slicer by Ultimaker. Aimed at their printers but supports other brands as well. Open source.",
            "category": "General"
        },
        {
            "name": "prusaslicer",
            "desc": "Slicer by Prusa Research. A fork of Slic3r. Aimed at their printers but supports other brands as well. Open source.",
            "category": "General"
        },
        {
            "name": "repetier-host",
            "desc": "Combined slicer and control software for 3D printers. Closed source.",
            "category": "General"
        },
        {
            "name": "intel quartus prime",
            "desc": "A set of design tools for Intel's FPGA devices that includes Quartus Prime, ModelSim-Intel, HLS Compiler, etc.",
            "category": "General"
        },
        {
            "name": "lattice diamond",
            "desc": "A set of design tools for Lattice's FPGA chips.",
            "category": "General"
        },
        {
            "name": "microsemi libero",
            "desc": "Development tools for designing with Microsemi's PolarFire, IGLOO2, SmartFusion2, RTG4, SmartFusion, IGLOO, ProASIC3 and Fusion families.",
            "category": "General"
        },
        {
            "name": "openfpgaloader",
            "desc": "Universal utility for programming FPGA. Try openfpgaloader-gitAUR if your board is not managed by the stable version.",
            "category": "General"
        },
        {
            "name": "verilator",
            "desc": "A Verilog/SystemVerilog simulator, performs lint code-quality checks, compile to threaded C++ code for simulation.",
            "category": "General"
        },
        {
            "name": "xilinx ise webpack",
            "desc": "FPGA programmable logic design suit.",
            "category": "General"
        },
        {
            "name": "arduino",
            "desc": "Arduino prototyping platform SDK.",
            "category": "General"
        },
        {
            "name": "platformio",
            "desc": "Collaborative platform for embedded development, embedded development, with debugger, unit testing, code analysis. Default IDE is VSCode, but can be u",
            "category": "General"
        },
        {
            "name": "stlink",
            "desc": "Open source STM32 MCU programming toolset for ST microcontrollers.",
            "category": "General"
        },
        {
            "name": "gnucap",
            "desc": "GNU circuit simulator.",
            "category": "General"
        },
        {
            "name": "ngspice",
            "desc": "The established Linux circuit simulator. Open source successor of the spice3f5 code. Has the most versatile user interface; supporting scripting withi",
            "category": "General"
        },
        {
            "name": "oregano",
            "desc": "Graphical software application for schematic capture and simulation of electrical circuits. The actual simulation is done by the ngspice or Gnucap eng",
            "category": "General"
        },
        {
            "name": "qucs",
            "desc": "Electronics circuit simulator application that gives you the ability to set up a circuit with a graphical user interface and simulate its large-signal",
            "category": "General"
        },
        {
            "name": "fritzing",
            "desc": "Easy to use program to draw good-looking circuit diagrams, and also create schematics and PCBs.",
            "category": "General"
        },
        {
            "name": "geda",
            "desc": "Full suite and toolkit of Electronic Design Automation tools that are used for electrical circuit design, schematic capture, simulation, prototyping, ",
            "category": "General"
        },
        {
            "name": "geda pcb",
            "desc": "Interactive printed circuit board editor.",
            "category": "General"
        },
        {
            "name": "kicad",
            "desc": "Software suite for electronic design automation (EDA) that facilitates the design of schematics for electronic circuits and their conversion to PCB (p",
            "category": "General"
        },
        {
            "name": "ktechlab",
            "desc": "IDE for microcontrollers and electronic circuit simulation.",
            "category": "General"
        },
        {
            "name": "gnu radio",
            "desc": "Software development toolkit that provides signal processing blocks to implement software radios.",
            "category": "General"
        },
        {
            "name": "anylogic",
            "desc": "AnyLogic is a cross-platform proprietary multimethod simulation modeling tool, which is also available for personal use.",
            "category": "General"
        },
        {
            "name": "flight gear",
            "desc": "Open-source, multi-platform atmospheric and orbital flight simulator with a flight dynamics engine (JSBSim) that is part of a 2015 NASA benchmark to j",
            "category": "General"
        },
        {
            "name": "gephi",
            "desc": "Gephi is an open-source network analysis and visualization software package written in Java.",
            "category": "General"
        },
        {
            "name": "shadow",
            "desc": "An open-source distributed system/network simulator/emulator hybrid (e.g. for Tor and Bitcoin).",
            "category": "General"
        },
        {
            "name": "simgrid",
            "desc": "A scientific instrument to study large-scale distributed systems.",
            "category": "General"
        },
        {
            "name": "gns3",
            "desc": "Network software emulator using a combination of virtual and real devices to simulate complex networks.",
            "category": "General"
        },
        {
            "name": "ns-2",
            "desc": "Discrete event simulator targeted at networking research.",
            "category": "General"
        },
        {
            "name": "ns-3",
            "desc": "Discrete-event network simulator for Internet systems.",
            "category": "General"
        },
        {
            "name": "omnet++",
            "desc": "Component-based simulation package designed for modeling communication networks.",
            "category": "General"
        },
        {
            "name": "alacritty",
            "desc": "A cross-platform, GPU-accelerated terminal emulator.",
            "category": "General"
        },
        {
            "name": "eterm",
            "desc": "Terminal emulator intended as a replacement for xterm and designed for the Enlightenment desktop.",
            "category": "General"
        },
        {
            "name": "foot",
            "desc": "Lightweight terminal emulator for Wayland with sixel support.",
            "category": "General"
        },
        {
            "name": "ghostty",
            "desc": "Fast, native, feature-rich terminal emulator pushing modern features.",
            "category": "General"
        },
        {
            "name": "hyper",
            "desc": "A terminal with JS/CSS support. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "kitty",
            "desc": "A modern, hackable, featureful, OpenGL based terminal emulator",
            "category": "General"
        },
        {
            "name": "konsole",
            "desc": "Terminal emulator included in the KDE desktop. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "mlterm",
            "desc": "A multi-lingual terminal emulator supporting various character sets and encodings, variable-width fonts and bidi rendering.",
            "category": "General"
        },
        {
            "name": "putty",
            "desc": "Highly configurable ssh/telnet/serial console program.",
            "category": "General"
        },
        {
            "name": "rxvt-unicode (urxvt)",
            "desc": "Terminal emulator forked from rxvt, customizable with source-code patches, X resources and Perl extensions.",
            "category": "General"
        },
        {
            "name": "st",
            "desc": "Simple terminal implementation for X.",
            "category": "General"
        },
        {
            "name": "station",
            "desc": "Terminal emulation features different view modes such as split vertically and horizontally, a tabbed interface, and copy and paste commands. Part of m",
            "category": "General"
        },
        {
            "name": "wezterm",
            "desc": "GPU-accelerated cross-platform terminal emulator and multiplexer implemented in Rust.",
            "category": "General"
        },
        {
            "name": "xterm",
            "desc": "Simple terminal emulator for the X Window System. It provides DEC VT102 and Tektronix 4014 compatible terminals for programs that cannot use the windo",
            "category": "General"
        },
        {
            "name": "yakuake",
            "desc": "Drop-down terminal (Quake style) emulator based on Konsole. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "gnome console",
            "desc": "Formerly known as King’s Cross, a simple user-friendly terminal emulator for the GNOME desktop. Part of gnome.",
            "category": "General"
        },
        {
            "name": "gnome terminal",
            "desc": "A terminal emulator included in the GNOME desktop with support for Unicode. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "guake",
            "desc": "Drop-down terminal for the GNOME desktop.",
            "category": "General"
        },
        {
            "name": "lxterminal",
            "desc": "Desktop independent terminal emulator for LXDE.",
            "category": "General"
        },
        {
            "name": "mate terminal",
            "desc": "A fork of GNOME Terminal for the MATE desktop.",
            "category": "General"
        },
        {
            "name": "terminator",
            "desc": "Terminal emulator supporting multiple resizable terminal panels.",
            "category": "General"
        },
        {
            "name": "termite",
            "desc": "Keyboard-centric VTE-based terminal, aimed at use within a window manager with tiling and/or tabbing support. Unmaintained - the developers recommend ",
            "category": "General"
        },
        {
            "name": "xfce terminal",
            "desc": "Terminal emulator included in the Xfce desktop with support for a colorized prompt and a tabbed interface.",
            "category": "General"
        },
        {
            "name": "kmscon",
            "desc": "A KMS/DRM-based system console(getty) with an integrated terminal emulator for Linux operating systems.",
            "category": "General"
        },
        {
            "name": "fbterm",
            "desc": "a fast FrameBuffer based TERMinal emulator for linux",
            "category": "General"
        },
        {
            "name": "less",
            "desc": "A program similar to more, but with support for both forward and backward scrolling, as well as partial loading of files.",
            "category": "General"
        },
        {
            "name": "more",
            "desc": "A simple and feature-light pager. It is a part of util-linux.",
            "category": "General"
        },
        {
            "name": "most",
            "desc": "A pager with support for multiple windows, left and right scrolling, and built-in colour support",
            "category": "General"
        },
        {
            "name": "abduco",
            "desc": "Tool for session attach and detach support which allows a process to run independently from its controlling terminal.",
            "category": "General"
        },
        {
            "name": "byobu",
            "desc": "A GPLv3 licensed addon for tmux or screen. It requires a terminal multiplexer installed.",
            "category": "General"
        },
        {
            "name": "dtach",
            "desc": "Program that emulates the detach feature of GNU Screen.",
            "category": "General"
        },
        {
            "name": "dvtm",
            "desc": "dwm-style window manager in the console.",
            "category": "General"
        },
        {
            "name": "gnu screen",
            "desc": "Full-screen window manager that multiplexes a physical terminal.",
            "category": "General"
        },
        {
            "name": "tmate",
            "desc": "A fork of tmux aiming to help with remote access and pair programming.",
            "category": "General"
        },
        {
            "name": "tmux",
            "desc": "BSD licensed terminal multiplexer.",
            "category": "General"
        },
        {
            "name": "ded (directory-editor)",
            "desc": "The enhancement of dired, is similar to Emacs Dired.",
            "category": "General"
        },
        {
            "name": "dired (directory editor)",
            "desc": "The file manager integrated with Emacs.",
            "category": "General"
        },
        {
            "name": "lf",
            "desc": "Terminal file manager written in Go using server/client architecture.",
            "category": "General"
        },
        {
            "name": "midnight commander",
            "desc": "Console-based, dual-paneled file manager.",
            "category": "General"
        },
        {
            "name": "nnn",
            "desc": "Tiny, lightning fast, feature-packed file manager.",
            "category": "General"
        },
        {
            "name": "pilot",
            "desc": "File manager that comes with the Alpine email client.",
            "category": "General"
        },
        {
            "name": "ranger",
            "desc": "Console-based file manager with vi bindings, customizability, and lots of features.",
            "category": "General"
        },
        {
            "name": "vifm",
            "desc": "Ncurses-based two-panel file manager with vi-like keybindings.",
            "category": "General"
        },
        {
            "name": "deepin file manager",
            "desc": "File manager developed for Deepin.",
            "category": "General"
        },
        {
            "name": "dolphin",
            "desc": "File manager included in the KDE desktop. Part of kde-system.",
            "category": "General"
        },
        {
            "name": "gnome files",
            "desc": "Extensible, heavyweight file manager used by default in GNOME with support for custom scripts. Part of gnome.",
            "category": "General"
        },
        {
            "name": "index",
            "desc": "File manager that lets you browse your system files and applications and preview your music, text, image and video files and share them with external ",
            "category": "General"
        },
        {
            "name": "konqueror",
            "desc": "File manager and web browser for the KDE desktop. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "nemo",
            "desc": "Nemo is the file manager of the Cinnamon desktop. A fork of Nautilus.",
            "category": "General"
        },
        {
            "name": "pathfinder",
            "desc": "File browser that comes with the FOX toolkit.",
            "category": "General"
        },
        {
            "name": "pcmanfm",
            "desc": "Very fast and lightweight file manager which can also optionally manage the desktop icons and background.",
            "category": "General"
        },
        {
            "name": "pcmanfm-qt",
            "desc": "Qt port of PCManFM file manager.",
            "category": "General"
        },
        {
            "name": "thunar",
            "desc": "File manager that can be run as a daemon with excellent start up and directory load times.",
            "category": "General"
        },
        {
            "name": "gnome commander",
            "desc": "A dual-paned file manager for the GNOME Desktop.",
            "category": "General"
        },
        {
            "name": "krusader",
            "desc": "Advanced twin panel (Midnight Commander style) file manager for the KDE desktop.",
            "category": "General"
        },
        {
            "name": "spacefm",
            "desc": "GTK multi-panel tabbed file manager.",
            "category": "General"
        },
        {
            "name": "xfe",
            "desc": "Microsoft Explorer-like file manager for X (X File Explorer).",
            "category": "General"
        },
        {
            "name": "borg",
            "desc": "Deduplicating backup program with compression and authenticated encryption that supports backing up over ssh.",
            "category": "General"
        },
        {
            "name": "duplicity",
            "desc": "Simple command-line utility which allows encrypted compressed incremental backup to nearly any storage.",
            "category": "General"
        },
        {
            "name": "duply",
            "desc": "Command-line front-end for duplicity which simplifies running it. It manages backup job settings in profiles and allows to batch execute commands.",
            "category": "General"
        },
        {
            "name": "git-annex",
            "desc": "Manage files with git, without checking the file contents into git.",
            "category": "General"
        },
        {
            "name": "rsync",
            "desc": "File transfer program that uses the \"rsync algorithm\" which provides a very fast method for bringing remote files into sync. It does this by sending j",
            "category": "General"
        },
        {
            "name": "tarsnap",
            "desc": "Secure, efficient proprietary online backup service.",
            "category": "General"
        },
        {
            "name": "unison",
            "desc": "File synchronization tool that allows two replicas of a collection of files and directories to be stored on different hosts (or different disks on the",
            "category": "General"
        },
        {
            "name": "déjà dup",
            "desc": "Simple GTK backup program. It hides the complexity of doing backups the 'right way' (encrypted, off-site, and regular) and uses Restic as the backend.",
            "category": "General"
        },
        {
            "name": "duplicati",
            "desc": "Backup client that securely stores encrypted, incremental, compressed backups on cloud storage services and remote file servers.",
            "category": "General"
        },
        {
            "name": "freefilesync",
            "desc": "Folder comparison and synchronization software that creates and manages backup copies of all your important files.",
            "category": "General"
        },
        {
            "name": "grsync",
            "desc": "GTK GUI for rsync to synchronize folders, files and make backups",
            "category": "General"
        },
        {
            "name": "kbackup",
            "desc": "Backup program with an easy to use user interface based on the KDE Frameworks. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kup",
            "desc": "Backup scheduler for the Plasma desktop. It uses bup and rsync as backend.",
            "category": "General"
        },
        {
            "name": "pika backup",
            "desc": "Easy to use backup tool to keep your data safe. Uses Borg as backend.",
            "category": "General"
        },
        {
            "name": "sparkleshare",
            "desc": "File sharing and collaboration application written in C#. It can sync with any Git server over SSH.",
            "category": "General"
        },
        {
            "name": "syncthing",
            "desc": "Continuous file synchronization program. It synchronizes files between two or more computers in a simple way without advanced configuration.",
            "category": "General"
        },
        {
            "name": "synkron",
            "desc": "Application that helps you keep your files and folders always updated. You can easily sync your documents, music or pictures to have their latest vers",
            "category": "General"
        },
        {
            "name": "vorta",
            "desc": "Encrypted, deduplicated and compressed backups using Borg as backend.",
            "category": "General"
        },
        {
            "name": "arca",
            "desc": "Archiver for compressed files. Part of maui.",
            "category": "General"
        },
        {
            "name": "ark",
            "desc": "Archiving tool included in the KDE desktop. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "engrampa",
            "desc": "Archive manager for MATE",
            "category": "General"
        },
        {
            "name": "file roller",
            "desc": "Archive manager for the GNOME desktop. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "peazip",
            "desc": "Open source file and archive manager.",
            "category": "General"
        },
        {
            "name": "xarchiver",
            "desc": "Lightweight desktop independent archive manager built with GTK.",
            "category": "General"
        },
        {
            "name": "kompare",
            "desc": "GUI front-end program for viewing and merging differences between source files. It supports a variety of diff formats and provides many options to cus",
            "category": "General"
        },
        {
            "name": "meld",
            "desc": "Visual diff and merge tool that can compare files, directories, and version controlled projects.",
            "category": "General"
        },
        {
            "name": "gprename",
            "desc": "GTK batch renamer for files and directories.",
            "category": "General"
        },
        {
            "name": "krename",
            "desc": "Very powerful batch file renamer for the KDE desktop.",
            "category": "General"
        },
        {
            "name": "thunar bulk rename",
            "desc": "Change the name of multiple files at once using some criterion that applies to at least one of the files. Run with thunar -B.",
            "category": "General"
        },
        {
            "name": "gnome search tool",
            "desc": "GNOME utility to search for files, depends on GNOME Files.",
            "category": "General"
        },
        {
            "name": "kfind",
            "desc": "Search tool for KDE to find files by name, type or content. Has internal search and supports locate. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "baloo",
            "desc": "KDE's file indexing and search solution, has a CLI and is used by KRunner.",
            "category": "General"
        },
        {
            "name": "docfetcher",
            "desc": "Graphical Java desktop search application.",
            "category": "General"
        },
        {
            "name": "localsearch",
            "desc": "LocalSearch is the indexer and search engine that powers desktop search for core GNOME components, replacing Tracker.",
            "category": "General"
        },
        {
            "name": "recoll",
            "desc": "Full text search tool based on Xapian, has CLI and GUI.",
            "category": "General"
        },
        {
            "name": "zeitgeist",
            "desc": "Event aggregation framework for the user's activities and notifications (files opened, websites visited, conversations had, etc.), has several third-p",
            "category": "General"
        },
        {
            "name": "forgejo",
            "desc": "A lightweight software forge. Community project built on top of Gitea.",
            "category": "General"
        },
        {
            "name": "gitea",
            "desc": "Painless self-hosted Git service. Fork of Gogs.",
            "category": "General"
        },
        {
            "name": "gitlab",
            "desc": "Project management and code hosting application.",
            "category": "General"
        },
        {
            "name": "radicle",
            "desc": "Open source, peer-to-peer code collaboration stack built on Git.",
            "category": "General"
        },
        {
            "name": "gogs",
            "desc": "Self Hosted Git Service, written in Go.",
            "category": "General"
        },
        {
            "name": "breezy",
            "desc": "A decentralized revision control system with support for Bazaar and Git file formats.",
            "category": "General"
        },
        {
            "name": "cvs",
            "desc": "Concurrent Versions System, a client-server revision control system.",
            "category": "General"
        },
        {
            "name": "darcs",
            "desc": "Distributed revision control system that was designed to replace traditional, centralized source control systems such as CVS and Subversion.",
            "category": "General"
        },
        {
            "name": "fossil",
            "desc": "Distributed VCS with bug tracking, wiki, forum, and technotes.",
            "category": "General"
        },
        {
            "name": "git",
            "desc": "Distributed revision control and source code management system with an emphasis on speed.",
            "category": "General"
        },
        {
            "name": "mercurial",
            "desc": "Distributed version control system written in Python and similar in many ways to Git.",
            "category": "General"
        },
        {
            "name": "subversion",
            "desc": "Full-featured centralized version control system originally designed to be a better CVS.",
            "category": "General"
        },
        {
            "name": "apache ant",
            "desc": "Java library and command-line tool whose mission is to drive processes described in build files as targets and extension points dependent upon each ot",
            "category": "General"
        },
        {
            "name": "apache maven",
            "desc": "Build automation tool used primarily for Java.",
            "category": "General"
        },
        {
            "name": "bazel",
            "desc": "An open-source tool that allows for the automated building and testing of software.",
            "category": "General"
        },
        {
            "name": "cmake",
            "desc": "Family of tools designed to build, test and package software.",
            "category": "General"
        },
        {
            "name": "gnu make",
            "desc": "GNU make utility to maintain groups of programs.",
            "category": "General"
        },
        {
            "name": "gradle",
            "desc": "Powerful build system for the JVM.",
            "category": "General"
        },
        {
            "name": "meson",
            "desc": "Extremely fast and user friendly build system.",
            "category": "General"
        },
        {
            "name": "xmake",
            "desc": "A cross-platform build utility based on Lua with a built-in package manager.",
            "category": "General"
        },
        {
            "name": "android studio",
            "desc": "The official Android development environment based on IntelliJ IDEA.",
            "category": "General"
        },
        {
            "name": "anjuta",
            "desc": "Versatile IDE with project management, an application wizard, an interactive debugger, a source editor, version control support and many more tools.",
            "category": "General"
        },
        {
            "name": "aptana studio",
            "desc": "IDE based on Eclipse, but geared towards web development, with support for HTML, CSS, Javascript, Ruby on Rails, PHP, Adobe AIR and others.",
            "category": "General"
        },
        {
            "name": "bluefish",
            "desc": "Powerful editor targeted towards programmers and webdevelopers, with many options to write websites, scripts and programming code. It supports many pr",
            "category": "General"
        },
        {
            "name": "builder",
            "desc": "Tool to write and contribute to great GNOME-based applications. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "clion",
            "desc": "A cross-platform IDE for C and C++.",
            "category": "General"
        },
        {
            "name": "code::blocks",
            "desc": "C, C++ and Fortran IDE built to meet the most demanding needs of its users. It is designed to be very extensible and fully configurable.",
            "category": "General"
        },
        {
            "name": "codelite",
            "desc": "Open source and cross-platform C/C++/PHP and Node.js IDE written in C++ .",
            "category": "General"
        },
        {
            "name": "eclipse",
            "desc": "IDE for Java, C/C++, PHP, Perl and Python with subversion support and task management.",
            "category": "General"
        },
        {
            "name": "eric",
            "desc": "Full-featured Python and Ruby IDE written in PyQt5.",
            "category": "General"
        },
        {
            "name": "gambas",
            "desc": "IDE based on a Basic interpreter with object extensions.",
            "category": "General"
        },
        {
            "name": "geany",
            "desc": "Small and lightweight IDE with many supported programming and markup languages including C, Java, PHP, HTML, Python, Perl, Pascal.",
            "category": "General"
        },
        {
            "name": "kdevelop",
            "desc": "Feature-full, plugin extensible IDE for C/C++ and other programming languages. Part of kde-applications.",
            "category": "General"
        },
        {
            "name": "komodo edit",
            "desc": "A free, multi-language editor.",
            "category": "General"
        },
        {
            "name": "lazarus",
            "desc": "Delphi (Object Pascal) compatible IDE for Rapid Application Development. It has variety of components ready for use and a graphical form designer to e",
            "category": "General"
        },
        {
            "name": "mplab",
            "desc": "IDE for Microchip PIC and dsPIC development.",
            "category": "General"
        },
        {
            "name": "netbeans",
            "desc": "IDE for developing with Java, JavaScript, PHP, Python, Ruby, Groovy, C, C++, Scala, Clojure, and other languages.",
            "category": "General"
        },
        {
            "name": "phpstorm",
            "desc": "JetBrains PhpStorm is a commercial, cross-platform IDE for PHP built on JetBrains' IntelliJ IDEA platform, providing an editor for PHP, HTML and JavaS",
            "category": "General"
        },
        {
            "name": "qt creator",
            "desc": "Lightweight, cross-platform C++ integrated development environment with a focus on Qt.",
            "category": "General"
        },
        {
            "name": "strike",
            "desc": "Simple and covergent IDE that works on desktop and mobile computers. Part of maui.",
            "category": "General"
        },
        {
            "name": "theia",
            "desc": "Eclipse Theia is a free and open-source IDE for desktop and web applications. It is implemented in TypeScript, is based on Visual Studio Code, and emp",
            "category": "General"
        },
        {
            "name": "visual studio code",
            "desc": "Visual Studio Code is a cross-platform, free and open-source text editor developed by Microsoft, written in JavaScript and TypeScript. It supports a v",
            "category": "General"
        },
        {
            "name": "vscodium",
            "desc": "Free/Libre Open Source Software Binaries of VSCode.",
            "category": "General"
        },
        {
            "name": "zerobrane studio",
            "desc": "IDE with debugging support for Lua 5.1, Lua 5.2, Lua 5.3, LuaJIT, and other Lua engines.",
            "category": "General"
        },
        {
            "name": "bluej",
            "desc": "Fully featured Java IDE used mainly for educational and beginner purposes.",
            "category": "General"
        },
        {
            "name": "intellij idea",
            "desc": "IDE for Java, Kotlin, Scala, Groovy and other programming languages. Has advanced refactoring features.",
            "category": "General"
        },
        {
            "name": "ninja-ide",
            "desc": "Qt5 based IDE for Python development written in Python.",
            "category": "General"
        },
        {
            "name": "pycharm",
            "desc": "Python IDE with support for code analysis, debugging, unit testing, version control and web development with Django.",
            "category": "General"
        },
        {
            "name": "pydev",
            "desc": "Eclipse IDE plug-in that adds Python support.",
            "category": "General"
        },
        {
            "name": "spyder",
            "desc": "Scientific Python Development Environment providing MATLAB-like features.",
            "category": "General"
        },
        {
            "name": "thonny",
            "desc": "Python IDE for beginners.",
            "category": "General"
        },
        {
            "name": "wingide",
            "desc": "Proprietary Python development environment. It is fully featured and meant for professional use.",
            "category": "General"
        },
        {
            "name": "kturtle",
            "desc": "Educational programming environment that aims to make learning how to program as easily as possible. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "processing",
            "desc": "Playground for teaching non-programmers the fundamentals of computer programming in a visual context.",
            "category": "General"
        },
        {
            "name": "scratch",
            "desc": "Programming system and content development tool for educational and entertainment purposes, such as creating interactive projects and simple sprite-ba",
            "category": "General"
        },
        {
            "name": "accerciser",
            "desc": "Interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an appl",
            "category": "General"
        },
        {
            "name": "accessibility inspector",
            "desc": "Inspector for application accessibility tree. Part of kde-accessibility.",
            "category": "General"
        },
        {
            "name": "data display debugger",
            "desc": "Graphical front-end for command-line debuggers such as GDB.",
            "category": "General"
        },
        {
            "name": "drkonqi",
            "desc": "Crash handler for KDE software. It also provides a GUI for coredumpctl, called drkonqi-coredump-gui. Part of plasma.",
            "category": "General"
        },
        {
            "name": "gdb",
            "desc": "Native code debugger from the GNU Project.",
            "category": "General"
        },
        {
            "name": "kdebugsettings",
            "desc": "Application to choose which QLoggingCategory are displayed by editing the user's global qtlogging.ini configuration file. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "lldb",
            "desc": "Modern native code debugger from the LLVM project.",
            "category": "General"
        },
        {
            "name": "nemiver",
            "desc": "Easy to use standalone C/C++ debugger (GDB front-end) that integrates well in the GNOME environment.",
            "category": "General"
        },
        {
            "name": "valgrind",
            "desc": "Tool to help find memory-management problems in programs.",
            "category": "General"
        },
        {
            "name": "gprof",
            "desc": "Profile analysis tool for programs instrumented with GCC.",
            "category": "General"
        },
        {
            "name": "hotspot",
            "desc": "GUI for exploring profile data collected with perf.",
            "category": "General"
        },
        {
            "name": "kcachegrind",
            "desc": "GUI for exploring profile data collected with Valgrind's cachegrind tool. Part of kde-sdk.",
            "category": "General"
        },
        {
            "name": "perf",
            "desc": "Official CLI for the Linux kernel's perf_events profiling subsystem.",
            "category": "General"
        },
        {
            "name": "sysprof",
            "desc": "Profiling tool that helps in finding the functions in which a program uses most of its time. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "berkeley yacc",
            "desc": "Berkeley reimplementation of the Unix parser generator Yacc.",
            "category": "General"
        },
        {
            "name": "flex",
            "desc": "A tool for generating text-scanning programs, alternative to Lex.",
            "category": "General"
        },
        {
            "name": "gnu bison",
            "desc": "The GNU general-purpose parser generator, alternative to byacc.",
            "category": "General"
        },
        {
            "name": "antlr",
            "desc": "Parser generator, written in Java, for parsing structured text or binary files.",
            "category": "General"
        },
        {
            "name": "dialog",
            "desc": "TUI widgets built using ncurses.",
            "category": "General"
        },
        {
            "name": "kdialog",
            "desc": "Qt-based GUI prompts by KDE. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "zenity",
            "desc": "GTK-based GUI prompts by GNOME.",
            "category": "General"
        },
        {
            "name": "cambalache",
            "desc": "A RAD tool for GTK 4 and 3 with a clear MVC design and data model first philosophy. (Work in progress)",
            "category": "General"
        },
        {
            "name": "fluid",
            "desc": "FLTK GUI designer.",
            "category": "General"
        },
        {
            "name": "glade",
            "desc": "Create or open user interface designs for GTK applications. Part of gnome-extra. (GTK 3 only)",
            "category": "General"
        },
        {
            "name": "kuiviewer",
            "desc": "Quick viewer for Qt Designer UI File. Part of kde-sdk.",
            "category": "General"
        },
        {
            "name": "ghex",
            "desc": "Hex editor for GNOME, which allows the user to load data from any file, view and edit it in either hex or ascii. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "kimagemapeditor",
            "desc": "Editor of image maps embedded inside HTML files, based on the <map> tag. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "jq",
            "desc": "jq is a lightweight and flexible command-line JSON processor.",
            "category": "General"
        },
        {
            "name": "elvish",
            "desc": "The  shell has built-in support for JSON.",
            "category": "General"
        },
        {
            "name": "argouml",
            "desc": "UML modeling tool with support for all standard UML 1.4 diagrams.",
            "category": "General"
        },
        {
            "name": "eclipse modeling tools",
            "desc": "Tools and runtimes for building model-based applications.",
            "category": "General"
        },
        {
            "name": "modelio",
            "desc": "Modeling environment supporting the main standards: UML, BPMN, MDA, SysML.",
            "category": "General"
        },
        {
            "name": "papyrus",
            "desc": "Model-based engineering tool based on Eclipse.",
            "category": "General"
        },
        {
            "name": "plantuml",
            "desc": "Tool to create UML diagrams from a plain text language.",
            "category": "General"
        },
        {
            "name": "umbrello",
            "desc": "Unified Modelling Language (UML) diagram program based on KDE Technology. Part of kde-sdk.",
            "category": "General"
        },
        {
            "name": "umlet",
            "desc": "UML tool with a simple user interface: draw UML diagrams fast, build sequence and activity diagrams from plain text, export diagrams to eps, pdf, jpg,",
            "category": "General"
        },
        {
            "name": "devhelp",
            "desc": "Developer tool for browsing and searching API documentation.",
            "category": "General"
        },
        {
            "name": "manuals",
            "desc": "Developer documentation browser for GNOME. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "bugzilla",
            "desc": "Bug tracker from Mozilla.",
            "category": "General"
        },
        {
            "name": "flyspray",
            "desc": "Lightweight, web-based bug tracking system written in PHP",
            "category": "General"
        },
        {
            "name": "mantisbt",
            "desc": "Web-based issue tracking system",
            "category": "General"
        },
        {
            "name": "redmine",
            "desc": "A flexible project management web application. Written using the Ruby on Rails, it is cross-platform and cross-database.",
            "category": "General"
        },
        {
            "name": "trac",
            "desc": "Trac Integrated SCM and Project Management using Apache and Subversion.",
            "category": "General"
        },
        {
            "name": "gitlab",
            "desc": "also supports code reviews.",
            "category": "General"
        },
        {
            "name": "allegro",
            "desc": "A cross-platform library mainly aimed at video game and multimedia programming.",
            "category": "General"
        },
        {
            "name": "godot",
            "desc": "Advanced, feature-packed, multi-platform 2D and 3D game engine. Create games with ease, using Godot's unique approach to game development.",
            "category": "General"
        },
        {
            "name": "unity",
            "desc": "Unity is a flexible and powerful development platform for creating multi-platform 3D and 2D games. Proprietary, but a free version is available for ce",
            "category": "General"
        },
        {
            "name": "unreal engine",
            "desc": "A proprietary 3D computer graphics game engine developed by Epic Games",
            "category": "General"
        },
        {
            "name": "gnome characters",
            "desc": "Character map application for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "gucharmap",
            "desc": "GTK 3 character selector for GNOME.",
            "category": "General"
        },
        {
            "name": "kcharselect",
            "desc": "Tool to select special characters from all installed fonts and copy them into the clipboard. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "plasma emoji selector",
            "desc": "An emoji picker for Plasma. Run with plasma-emojier. Part of plasma.",
            "category": "General"
        },
        {
            "name": "squeekboard",
            "desc": "GTK 3 virtual keyboard for Wayland, written in Rust/C.",
            "category": "General"
        },
        {
            "name": "kdiskfree",
            "desc": "Displays information about hard disks and other storage devices. It also allows to mount and unmount drives and view them in a file manager. Part of k",
            "category": "General"
        },
        {
            "name": "ws",
            "desc": "Mount Windows network shares (CIFS and VFS).",
            "category": "General"
        },
        {
            "name": "filelight",
            "desc": "Disk usage analyzer that creates an interactive map of concentric, segmented rings that help visualise disk usage on your computer. Part of kde-utilit",
            "category": "General"
        },
        {
            "name": "gnome disk usage analyzer",
            "desc": "Disk usage analyzer for the GNOME desktop to check folder sizes and available disk space. Part of gnome.",
            "category": "General"
        },
        {
            "name": "fdupes",
            "desc": "Program for identifying or deleting duplicate files residing within specified directories.",
            "category": "General"
        },
        {
            "name": "bleachbit",
            "desc": "Frees disk space and guards your privacy; frees cache, deletes cookies, clears Internet history, shreds temporary files, deletes logs, and discards ju",
            "category": "General"
        },
        {
            "name": "sweeper",
            "desc": "System cleaning utility for KDE. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "fedora media writer",
            "desc": "Tool that helps users put Fedora images on their portable drives such as flash disks.",
            "category": "General"
        },
        {
            "name": "iso image writer",
            "desc": "KDE tool to write a .iso file to a USB disk. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "multiwriter",
            "desc": "Write an ISO file to multiple USB devices at once. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "unetbootin",
            "desc": "Installs Linux/BSD distributions to a partition or USB drive.",
            "category": "General"
        },
        {
            "name": "ventoy",
            "desc": "A New Bootable USB Solution.",
            "category": "General"
        },
        {
            "name": "htop",
            "desc": "Simple, ncurses interactive process viewer.",
            "category": "General"
        },
        {
            "name": "conky",
            "desc": "Lightweight, scriptable system monitor.",
            "category": "General"
        },
        {
            "name": "gkrellm",
            "desc": "Simple, flexible system monitor package for GTK with many plug-ins.",
            "category": "General"
        },
        {
            "name": "gnome system monitor",
            "desc": "System monitor for GNOME to view and manage system resources. Part of gnome.",
            "category": "General"
        },
        {
            "name": "lxtask",
            "desc": "Lightweight process manager for LXDE.",
            "category": "General"
        },
        {
            "name": "mate system monitor",
            "desc": "System monitor for MATE.",
            "category": "General"
        },
        {
            "name": "paramano",
            "desc": "Light battery monitor and a CPU frequency scaler. Forked from trayfreq",
            "category": "General"
        },
        {
            "name": "plasma system monitor",
            "desc": "Advanced and customizable system monitor for KDE. Part of plasma.",
            "category": "General"
        },
        {
            "name": "qt process manager",
            "desc": "Lightweight process manager for LXQt.",
            "category": "General"
        },
        {
            "name": "task manager",
            "desc": "GTK3 based process manager with basic system resource monitor for Xfce.",
            "category": "General"
        },
        {
            "name": "ukui system monitor",
            "desc": "System monitor for UKUI.",
            "category": "General"
        },
        {
            "name": "collectd",
            "desc": "Simple, extensible system monitoring daemon based on rrdtool. It has a small footprint and can be set up either stand-alone or as a server/client appl",
            "category": "General"
        },
        {
            "name": "netdata",
            "desc": "Web-based real-time performance monitor.",
            "category": "General"
        },
        {
            "name": "telegraf",
            "desc": "Agent written in Go for collecting, processing, aggregating, and writing metrics.",
            "category": "General"
        },
        {
            "name": "agesafetch",
            "desc": "A tool for identifying the AGESA version embedded in your AMD system's UEFI firmware.",
            "category": "General"
        },
        {
            "name": "hw-probe",
            "desc": "Tool to probe for hardware, check operability and find drivers with the help of Linux Hardware Database.",
            "category": "General"
        },
        {
            "name": "kinfocenter",
            "desc": "Centralized and convenient overview of system information for KDE. Part of plasma.",
            "category": "General"
        },
        {
            "name": "gnome logs",
            "desc": "Viewer for the systemd journal. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kjournald browser",
            "desc": "Provides a flexible tool to browse in local, remote and offline systemd-journald databases. Part of kde-system.",
            "category": "General"
        },
        {
            "name": "ksystemlog",
            "desc": "System log viewer tool for KDE. Part of kde-system.",
            "category": "General"
        },
        {
            "name": "gnome fonts",
            "desc": "Font viewer for GNOME. Part of gnome.",
            "category": "General"
        },
        {
            "name": "kfontview",
            "desc": "KDE application to view and install different types of fonts. Part of plasma.",
            "category": "General"
        },
        {
            "name": "kcron",
            "desc": "Tool for KDE to run applications in the background at regular intervals. It is a graphical interface to the Cron command. Part of kde-system.",
            "category": "General"
        },
        {
            "name": "ktimer",
            "desc": "Little tool for KDE to execute programs after some time. It allows you to enter several tasks and to set a timer for each of them. The timers for each",
            "category": "General"
        },
        {
            "name": "ansible",
            "desc": "IT automation engine that automates cloud provisioning, configuration management, application deployment, intra-service orchestration, and many other ",
            "category": "General"
        },
        {
            "name": "chef",
            "desc": "Automation Software for Continuous Delivery of Secure Applications and Infrastructure.",
            "category": "General"
        },
        {
            "name": "etckeeper",
            "desc": "Collection of tools to let /etc be stored in a VCS repository.",
            "category": "General"
        },
        {
            "name": "puppet",
            "desc": "IT automation software that helps system administrators manage infrastructure throughout its lifecycle, from provisioning and configuration to patch m",
            "category": "General"
        },
        {
            "name": "saltstack",
            "desc": "A Python-based, open-source software for event-driven IT automation, remote task execution, and configuration management.",
            "category": "General"
        },
        {
            "name": "jed",
            "desc": "Text editor that makes extensive use of the S-Lang library. Includes a console version (jed) and an X-window version (xjed).",
            "category": "General"
        },
        {
            "name": "joe (joe's own editor)",
            "desc": "Terminal-based text editor designed to be easy to use.",
            "category": "General"
        },
        {
            "name": "mcedit",
            "desc": "Useful text editor that comes with Midnight Commander file manager.",
            "category": "General"
        },
        {
            "name": "nano",
            "desc": "Console text editor based on pico with on-screen key bindings help.",
            "category": "General"
        },
        {
            "name": "emacs",
            "desc": "The extensible, customizable, self-documenting real-time display editor by GNU.",
            "category": "General"
        },
        {
            "name": "mg",
            "desc": "Small, fast, and portable Emacs-like editor.",
            "category": "General"
        },
        {
            "name": "vile",
            "desc": "Lightweight Emacs clone with vi-like key bindings.",
            "category": "General"
        },
        {
            "name": "busybox vi",
            "desc": "A small vi clone. Can be invoked with busybox vi.",
            "category": "General"
        },
        {
            "name": "helix",
            "desc": "A post-modern modal text editor.",
            "category": "General"
        },
        {
            "name": "kakoune",
            "desc": "Modal editor. Fewer keystrokes. Selection based, multi-cursor editing. Orthogonal design.",
            "category": "General"
        },
        {
            "name": "neovim",
            "desc": "Vim rebirth for the 21st century.",
            "category": "General"
        },
        {
            "name": "vi",
            "desc": "The original ex/vi text editor.",
            "category": "General"
        },
        {
            "name": "vim (vi improved)",
            "desc": "Is included as vi with most UNIX systems.",
            "category": "General"
        },
        {
            "name": "acme",
            "desc": "Minimalist and flexible programming environment developed by Rob Pike for the Plan 9 operating system.",
            "category": "General"
        },
        {
            "name": "gedit",
            "desc": "GTK editor for the GNOME desktop with syntax highlighting, automatic indentation, matching brackets, etc., and a number of add-ons to increase functio",
            "category": "General"
        },
        {
            "name": "gnome text editor",
            "desc": "Simple text editor for GNOME focused on a pleasing default experience. Part of gnome.",
            "category": "General"
        },
        {
            "name": "jedit",
            "desc": "Text editor for programmers, written in Java.",
            "category": "General"
        },
        {
            "name": "kate",
            "desc": "Full-featured programmer's editor for the KDE desktop with MDI and a filesystem browser. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "kwrite",
            "desc": "Lightweight text editor for the KDE desktop that uses the same editor widget as Kate, now provided by the kate package. Part of kde-utilities.",
            "category": "General"
        },
        {
            "name": "leafpad",
            "desc": "Notepad clone for GTK that emphasizes simplicity.",
            "category": "General"
        },
        {
            "name": "mousepad",
            "desc": "Fast text editor for the Xfce Desktop Environment.",
            "category": "General"
        },
        {
            "name": "nedit",
            "desc": "Text editor for the Motif environment.",
            "category": "General"
        },
        {
            "name": "nota",
            "desc": "Easy to use text editor with a simple interface with support for tabbed documents, syntax highlighting for various languages, Focus mode, annotations,",
            "category": "General"
        },
        {
            "name": "pluma",
            "desc": "Powerful text editor for MATE.",
            "category": "General"
        },
        {
            "name": "sam",
            "desc": "Minimalist text editor with a graphical user interface, a very powerful command language and remote editing capabilities, developed by Rob Pike.",
            "category": "General"
        },
        {
            "name": "scite",
            "desc": "Generally useful editor with facilities for building and running programs.",
            "category": "General"
        },
        {
            "name": "sublime text",
            "desc": "Proprietary C++ and Python-based editor with many advanced features and plugins while staying lightweight and pretty.",
            "category": "General"
        },
        {
            "name": "tea",
            "desc": "Qt-based feature-rich text editor.",
            "category": "General"
        },
        {
            "name": "textadept",
            "desc": "Lua-extensible feature rich text editor based on Scintilla and written in C.",
            "category": "General"
        },
        {
            "name": "visual studio code",
            "desc": "Editor for building and debugging modern web and cloud applications.",
            "category": "General"
        },
        {
            "name": "vscodium",
            "desc": "Visual Studio Code, but compiled without telemetry.",
            "category": "General"
        },
        {
            "name": "calligra",
            "desc": "Actively developed fork of KOffice, the KDE office suite. It offers most of the features of OpenOffice. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "google docs",
            "desc": "Cloud office solution by Google.",
            "category": "General"
        },
        {
            "name": "libreoffice",
            "desc": "The office productivity suite compatible to the open and standardized ODF document format. Fork of OpenOffice, supported by The Document Foundation.",
            "category": "General"
        },
        {
            "name": "onlyoffice",
            "desc": "Office suite that combines text, spreadsheet and presentation editors.",
            "category": "General"
        },
        {
            "name": "openoffice",
            "desc": "Open-source office software suite for word processing, spreadsheets, presentations, graphics, databases and more, under the Apache Licence.",
            "category": "General"
        },
        {
            "name": "softmaker freeoffice",
            "desc": "Complete, reliable, lightning-fast and Microsoft Office-compatible proprietary office suite with a word processor, spreadsheet, and presentation graph",
            "category": "General"
        },
        {
            "name": "wps office",
            "desc": "Proprietary office productivity suite, previously known as Kingsoft Office.",
            "category": "General"
        },
        {
            "name": "abiword",
            "desc": "Full-featured word processor.",
            "category": "General"
        },
        {
            "name": "calligra words",
            "desc": "Powerful word processor included in the Calligra Suite. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "libreoffice writer",
            "desc": "Full-featured word processor included in the LibreOffice suite.",
            "category": "General"
        },
        {
            "name": "openoffice writer",
            "desc": "Full-featured word processor included in the OpenOffice suite.",
            "category": "General"
        },
        {
            "name": "ted",
            "desc": "Easy to use GTK-based rich text processor (with footnote support).",
            "category": "General"
        },
        {
            "name": "wordgrinder",
            "desc": "Word processor for the console.",
            "category": "General"
        },
        {
            "name": "seamonkey composer",
            "desc": "Powerful yet simple HTML editor included in the SeaMonkey suite.",
            "category": "General"
        },
        {
            "name": "scribus",
            "desc": "Desktop publishing program. Uses hyphen and its language packs for hyphenation.",
            "category": "General"
        },
        {
            "name": "calligra stage",
            "desc": "Easy to use yet still flexible presentation application included in the Calligra Suite. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "libreoffice impress",
            "desc": "Presentation program included in the LibreOffice suite.",
            "category": "General"
        },
        {
            "name": "openoffice impress",
            "desc": "Presentation program included in the OpenOffice suite.",
            "category": "General"
        },
        {
            "name": "sozi",
            "desc": "Zooming presentation editor and player. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "sc",
            "desc": "Curses-based lightweight spreadsheet.",
            "category": "General"
        },
        {
            "name": "calligra sheets",
            "desc": "Powerful spreadsheet application included in the Calligra Suite. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "libreoffice calc",
            "desc": "Full-featured spreadsheet application included in the LibreOffice suite.",
            "category": "General"
        },
        {
            "name": "openoffice calc",
            "desc": "Full-featured spreadsheet application included in the OpenOffice suite.",
            "category": "General"
        },
        {
            "name": "pyspread",
            "desc": "Pyspread is a non-traditional spreadsheet application that is based on and written in the programming language Python.",
            "category": "General"
        },
        {
            "name": "adminer",
            "desc": "Full-featured database management webapp  with support for many database types.",
            "category": "General"
        },
        {
            "name": "dbeaver",
            "desc": "Java-based graphical database editor with support for many database types.",
            "category": "General"
        },
        {
            "name": "kexi",
            "desc": "Visual database applications creator tool by KDE, designed to fill the gap between spreadsheets and database solutions requiring more sophisticated de",
            "category": "General"
        },
        {
            "name": "libreoffice base",
            "desc": "Full-featured desktop database front end included in the LibreOffice suite, designed to meet the needs of a broad array of users.",
            "category": "General"
        },
        {
            "name": "openoffice base",
            "desc": "Full-featured desktop database front end included in the OpenOffice suite, designed to meet the needs of a broad array of users.",
            "category": "General"
        },
        {
            "name": "orbada",
            "desc": "Excellent tool for database developers, SQL developers, DBA administrators, as well as for users who wish to broaden their knowledge and skills in SQL",
            "category": "General"
        },
        {
            "name": "squirrel sql client",
            "desc": "Graphical Java program that will allow you to view the structure of a JDBC compliant database, browse the data in tables, issue SQL commands etc.",
            "category": "General"
        },
        {
            "name": "tora",
            "desc": "Database management GUI that supports accessing most of the common database platforms in use, including Oracle, MySQL, and PostgreSQL, as well as limi",
            "category": "General"
        },
        {
            "name": "libreoffice math",
            "desc": "Create and edit scientific formulas and equations. Included in the LibreOffice suite.",
            "category": "General"
        },
        {
            "name": "openoffice math",
            "desc": "Create equations and formulas for your documents. Included in the OpenOffice suite.",
            "category": "General"
        },
        {
            "name": "txt2tags",
            "desc": "Dead-simple, KISS-compliant lightweight, human-readable markup language to produce rich format content out of plain text files.",
            "category": "General"
        },
        {
            "name": "asciidoc.py",
            "desc": "A legacy implementation written in Python. Used by Arch for generating pacman's man pages.[1].",
            "category": "General"
        },
        {
            "name": "asciidoctor",
            "desc": "An implementation written in Ruby, with many extra features.",
            "category": "General"
        },
        {
            "name": "pandoc",
            "desc": "also supports Markdown.",
            "category": "General"
        },
        {
            "name": "mkdocs",
            "desc": "Project documentation with Markdown.",
            "category": "General"
        },
        {
            "name": "mkdocs",
            "desc": "Material design theme for MkDocs.",
            "category": "General"
        },
        {
            "name": "apostrophe",
            "desc": "Distraction free Markdown editor made with GTK.",
            "category": "General"
        },
        {
            "name": "ghostwriter",
            "desc": "Distraction-free Markdown editor. Part of kde-office.",
            "category": "General"
        },
        {
            "name": "mark text",
            "desc": "Next generation markdown editor. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "zettlr",
            "desc": "A cross-platform markdown editor, inspired by the Zettelkasten system for note-taking and personal knowledge management. Based on the Electron platfor",
            "category": "General"
        },
        {
            "name": "sphinx",
            "desc": "A documentation generation system using reStructuredText to generate output in multiple formats (primary documentation system for the Python project).",
            "category": "General"
        },
        {
            "name": "groff",
            "desc": "GNU implementation of troff, a heirloom Unix document processing system and the default formatter for man pages.",
            "category": "General"
        },
        {
            "name": "lout",
            "desc": "A lightware document formatting system. Reads a high-level description of a document similar in style to LaTeX and produces a PostScript.",
            "category": "General"
        },
        {
            "name": "tex",
            "desc": "A high-quality typesetting system popular in academia.",
            "category": "General"
        },
        {
            "name": "texinfo",
            "desc": "Typesetting syntax for software manuals used by the GNU Project.",
            "category": "General"
        },
        {
            "name": "auctex",
            "desc": "Together with RefTex, AUCTeX provices an extensible environment for writing and formatting TeX files in Emacs.",
            "category": "General"
        },
        {
            "name": "enter tex",
            "desc": "LaTeX editor for GNOME, previously known as GNOME LaTeX.",
            "category": "General"
        },
        {
            "name": "gedit latex plugin",
            "desc": "Add code-completion to gedit and allows for compiling LaTeX documents and managing BibTeX bibliographies.",
            "category": "General"
        },
        {
            "name": "gummi",
            "desc": "Lightweight TeX/LaTeX GTK-based editor. It features a continuous preview mode, integrated BibTeX support, extendable snippet interface and multi-docum",
            "category": "General"
        },
        {
            "name": "kile",
            "desc": "User-friendly TeX/LaTeX editor for the KDE desktop with many features.",
            "category": "General"
        },
        {
            "name": "ktikz",
            "desc": "Small application helping you to create PGF/TikZ diagrams for your publications.",
            "category": "General"
        },
        {
            "name": "lyx",
            "desc": "Document processor that encourages an approach to writing based on the structure of your documents (WYSIWYM) and not simply their appearance (WYSIWYG)",
            "category": "General"
        },
        {
            "name": "texmacs",
            "desc": "WYSIWYW (what you see is what you want) editing platform with special features for scientists.",
            "category": "General"
        },
        {
            "name": "texmaker",
            "desc": "Cross-platform, light and easy-to-use LaTeX IDE. It integrates many tools needed to develop documents with LaTeX, in just one application",
            "category": "General"
        },
        {
            "name": "texstudio",
            "desc": "Fork of TeXMaker including support for code completion of bibtex items, grammar check and automatic detection of the need for multiple LaTeX runs.",
            "category": "General"
        },
        {
            "name": "texworks",
            "desc": "Simple TeX front-end program modeled after TeXShop.",
            "category": "General"
        },
        {
            "name": "tikzit",
            "desc": "Graphical tool for rapidly creating graphs and diagrams using PGF/TikZ.",
            "category": "General"
        },
        {
            "name": "vim-latex-suite",
            "desc": "Customizable LaTeX environment for Vim.",
            "category": "General"
        },
        {
            "name": "antiword",
            "desc": "MS Word to text converter.",
            "category": "General"
        },
        {
            "name": "mutool",
            "desc": "All purpose tool based on MuPDF for dealing with document files in various manners.",
            "category": "General"
        },
        {
            "name": "pandoc",
            "desc": "Swiss-army knife for converting markup and document formats.",
            "category": "General"
        },
        {
            "name": "jabref",
            "desc": "Java GUI frontend for managing BibTeX and other bibliographies.",
            "category": "General"
        },
        {
            "name": "kbibtex",
            "desc": "BibTeX editor by KDE to edit bibliographies used with LaTeX.",
            "category": "General"
        },
        {
            "name": "mendeley desktop",
            "desc": "Proprietary reference manager and academic social network.",
            "category": "General"
        },
        {
            "name": "zotero",
            "desc": "An easy-to-use tool to help you collect, organize, cite, and share your research sources. Can import and export BibTeX and has browser extensions.",
            "category": "General"
        },
        {
            "name": "arianna",
            "desc": "An ebook reader and library management app supporting EPUB files. Part of kde-graphics.",
            "category": "General"
        },
        {
            "name": "calibre",
            "desc": "E-book library management application that can also edit EPUB files, convert between different formats and sync with a variety of e-book readers. Supp",
            "category": "General"
        },
        {
            "name": "fbreader",
            "desc": "E-book viewer with many supported formats such as EPUB, FictionBook, HTML, plucker, PalmDoc, zTxt, TCR, CHM, RTF, OEB, Mobipocket (non-DRM) and TXT.",
            "category": "General"
        },
        {
            "name": "sigil",
            "desc": "WYSIWYG EPUB e-book editor.",
            "category": "General"
        },
        {
            "name": "hakuneko",
            "desc": "Downloader for manga and anime from various websites. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "quickmedia",
            "desc": "Online manga reader. Supports automatically upscaling pages with waifu2x-ncnn-vulkan",
            "category": "General"
        },
        {
            "name": "kchmviewer",
            "desc": "Qt-based CHM viewer that uses chmlib and borrows some ideas from xchm. It does not depend on KDE, but it can be compiled to integrate with it.",
            "category": "General"
        },
        {
            "name": "xchm",
            "desc": "Lightweight CHM viewer, based on chmlib.",
            "category": "General"
        },
        {
            "name": "shelf",
            "desc": "Document collection manager that supports PDF files. Part of maui.",
            "category": "General"
        },
        {
            "name": "cuneiform",
            "desc": "Command line OCR system originally developed and open sourced by Cognitive technologies. Supported languages: eng, ger, fra, rus, swe, spa, ita, rusen",
            "category": "General"
        },
        {
            "name": "gocr",
            "desc": "OCR engine which also supports barcode recognition.",
            "category": "General"
        },
        {
            "name": "ocrad",
            "desc": "OCR program based on a feature extraction method.",
            "category": "General"
        },
        {
            "name": "tesseract",
            "desc": "Accurate open source OCR engine. Package splitted, you need install some datafiles for each language (tesseract-data-eng for example).",
            "category": "General"
        },
        {
            "name": "gscan2pdf",
            "desc": "Scans, runs an OCR engine, minor post-processing, creates a document.",
            "category": "General"
        },
        {
            "name": "ocrfeeder",
            "desc": "Python GUI for GNOME which performs document analysis and rendition, and can use either CuneiForm, GOCR, Ocrad or Tesseract as OCR engines. It can imp",
            "category": "General"
        },
        {
            "name": "eureka",
            "desc": "CLI tool to input and store your ideas without leaving the terminal",
            "category": "General"
        },
        {
            "name": "org mode",
            "desc": "Emacs mode for notes, project planning and authoring.",
            "category": "General"
        },
        {
            "name": "vimwiki",
            "desc": "Personal wiki for Vim – interlinked, plain text files written in a markup language.",
            "category": "General"
        },
        {
            "name": "basket",
            "desc": "Application for organizing, sharing, and taking notes. It can manage various types of information such as to-do lists, links, pictures, and other type",
            "category": "General"
        },
        {
            "name": "boostnote",
            "desc": "Note-taking application for programmers that focuses on markdown, snippets, and customizability. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "buho",
            "desc": "Task and note keeper to save links, write quick notes and organize pages as books. Part of maui.",
            "category": "General"
        },
        {
            "name": "encryptic",
            "desc": "JavaScript note taking application with Markdown editor and encryption support. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "fromscratch",
            "desc": "Simple but smart note-taking application that you can use as a quick note taking or todo app. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "gnome notes",
            "desc": "Note editor for GNOME designed to remain simple to use. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "gnote",
            "desc": "Port of Tomboy to C++. It is the same note taking application, including most of the add-ins.",
            "category": "General"
        },
        {
            "name": "joplin",
            "desc": "Note taking and to-do application, which can handle a large number of notes organized into notebooks on desktop or mobile devices. It synchronizes wit",
            "category": "General"
        },
        {
            "name": "mynotex",
            "desc": "Note-taking, document file and activity manager.",
            "category": "General"
        },
        {
            "name": "nextcloud notes",
            "desc": "Simple notes app for Nextcloud.",
            "category": "General"
        },
        {
            "name": "notion",
            "desc": "Note-taking, task management, project management, knowledge management software",
            "category": "General"
        },
        {
            "name": "qownnotes",
            "desc": "Notepad and todo list manager with markdown support and optional ownCloud integration built on Qt5.",
            "category": "General"
        },
        {
            "name": "simplenote",
            "desc": "The simplest way to keep notes. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "standard notes",
            "desc": "Simple and private notes application which focuses on simplicity, and encrypts data locally before it ever touches a cloud. Based on the Electron plat",
            "category": "General"
        },
        {
            "name": "tagspaces",
            "desc": "Offline personal data manager for managing of your local files. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "tiddlywiki",
            "desc": "Unique non-linear notebook for capturing, organizing and sharing complex information.",
            "category": "General"
        },
        {
            "name": "zim",
            "desc": "WYSIWYG text editor that aims at bringing the concept of a wiki to the desktop.",
            "category": "General"
        },
        {
            "name": "μpad",
            "desc": "Note-taking app that helps you organise + take notes without restrictions. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "saber",
            "desc": "Open source libre cross platform note taking app",
            "category": "General"
        },
        {
            "name": "xournal++",
            "desc": "Notetaking software designed around a tablet. C++ rewrite of Xournal with PDF annotation support.",
            "category": "General"
        },
        {
            "name": "freemind",
            "desc": "A mind mapper, and a hierarchical editor with strong emphasis on folding. Could be used for knowledge and content management.",
            "category": "General"
        },
        {
            "name": "freeplane",
            "desc": "Fork of FreeMind, supports thinking, sharing information and getting things done at work. The software can be used for mind mapping and analyzing the ",
            "category": "General"
        },
        {
            "name": "xmind",
            "desc": "Brainstorming and mind mapping application. It provides a rich set of different visualization styles, and allows sharing of created mind maps via thei",
            "category": "General"
        },
        {
            "name": "pyroom",
            "desc": "Fullscreen editor without buttons, widgets, formatting options, menus and with only the minimum of required dialog windows, it does not have any distr",
            "category": "General"
        },
        {
            "name": "trelby",
            "desc": "Simple, fast and elegantly laid out to make screenwriting simple.",
            "category": "General"
        },
        {
            "name": "dictd",
            "desc": "Client/server software for the DICT protocol.",
            "category": "General"
        },
        {
            "name": "sdcv",
            "desc": "Command line dictionary. It provides access to dictionaries in StarDict's format.",
            "category": "General"
        },
        {
            "name": "gnome dictionary",
            "desc": "GNOME application to check word definitions and spellings in an online dictionary. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "goldendict",
            "desc": "Feature-rich dictionary lookup program, supporting multiple dictionary formats.",
            "category": "General"
        },
        {
            "name": "goldendict-ng",
            "desc": "The Next Generation GoldenDict.",
            "category": "General"
        },
        {
            "name": "kiten",
            "desc": "Japanese reference and study tool. Part of kde-education.",
            "category": "General"
        },
        {
            "name": "apertium",
            "desc": "Free and open source rule-based machine translation platform with available language data. It supports the following formats: HTML, Microsoft Office 2",
            "category": "General"
        },
        {
            "name": "gtranslator",
            "desc": "Enhanced gettext po file editor for the GNOME. It handles all forms of gettext po files and includes very useful features.",
            "category": "General"
        },
        {
            "name": "lokalize",
            "desc": "Standard KDE tool for software translation. It includes basic editing of PO files, support for glossary, translation memory, project managing, etc. Pa",
            "category": "General"
        },
        {
            "name": "moses",
            "desc": "Statistical machine translation tool (language data not included).",
            "category": "General"
        },
        {
            "name": "omegat",
            "desc": "General translator's tool which contains a lot of translation memory features and can give suggestions from Google Translate. It supports the followin",
            "category": "General"
        },
        {
            "name": "poedit",
            "desc": "Simple translation editor for gettext (PO, POT) and XLIFF.",
            "category": "General"
        },
        {
            "name": "qt linguist",
            "desc": "Translating Qt C++ and Qt Quick applications into local languages.",
            "category": "General"
        },
        {
            "name": "translate toolkit",
            "desc": "Localization and translation toolkit, which provides a set of tools for working with localization file formats and files that might need localization.",
            "category": "General"
        },
        {
            "name": "zbar",
            "desc": "Application and library for reading bar codes from various sources.",
            "category": "General"
        },
        {
            "name": "mullvad",
            "desc": "A GUI client for the Mullvad VPN service",
            "category": "General"
        },
        {
            "name": "nebula",
            "desc": "A mesh VPN network",
            "category": "General"
        },
        {
            "name": "networkmanager",
            "desc": "Supports a variety of protocols (e.g. MS, Cisco, Fortinet) via a plugin system.",
            "category": "General"
        },
        {
            "name": "openconnect",
            "desc": "Supports Cisco and Juniper VPNs.",
            "category": "General"
        },
        {
            "name": "protonvpn",
            "desc": "VPN provider that uses the OpenVPN and WireGuard protocol.",
            "category": "General"
        },
        {
            "name": "openswan",
            "desc": "IPsec-based VPN Solution.",
            "category": "General"
        },
        {
            "name": "openvpn",
            "desc": "To connect to OpenVPN VPNs.",
            "category": "General"
        },
        {
            "name": "pptp client",
            "desc": "To connect to PPTP VPNs, like Microsoft VPNs (MPPE). (insecure)",
            "category": "General"
        },
        {
            "name": "rosenpass",
            "desc": "Hybrid security against quantum computers for WireGuard by adding a post-quantum-secure key exchange",
            "category": "General"
        },
        {
            "name": "strongswan",
            "desc": "IPsec-based VPN Solution.",
            "category": "General"
        },
        {
            "name": "tinc",
            "desc": "tinc is a free VPN daemon.",
            "category": "General"
        },
        {
            "name": "wireguard",
            "desc": "Next generation secure network tunnel.",
            "category": "General"
        },
        {
            "name": "dante",
            "desc": "SOCKS server and SOCKS client, implementing RFC:1928 and related standards.",
            "category": "General"
        },
        {
            "name": "hiddify",
            "desc": "Multiplatform chain proxy client based on sing-boxAUR.",
            "category": "General"
        },
        {
            "name": "naïveproxy",
            "desc": "A Proxy using Chrome's network stack to camouflage traffic with strong censorship resistence and low detectablility.",
            "category": "General"
        },
        {
            "name": "privoxy",
            "desc": "Non-caching web proxy with advanced filtering capabilities for enhancing privacy, modifying web page data and HTTP headers, controlling access, and re",
            "category": "General"
        },
        {
            "name": "shadowsocks",
            "desc": "Secure socks5 proxy, designed to protect your Internet traffic.",
            "category": "General"
        },
        {
            "name": "squid",
            "desc": "Caching proxy for the Web supporting HTTP, HTTPS, FTP, and more.",
            "category": "General"
        },
        {
            "name": "stunnel",
            "desc": "A server and client to add and remove TLS encryption to TCP data flow.",
            "category": "General"
        },
        {
            "name": "throne",
            "desc": "Cross-platform GUI proxy utility (Empowered by sing-boxAUR).",
            "category": "General"
        },
        {
            "name": "trojan",
            "desc": "An unidentifiable mechanism that helps you bypass GFW.",
            "category": "General"
        },
        {
            "name": "v2ray",
            "desc": "V2Ray is the core of Project V, which is a set of tools to help you build your own privacy network over the internet.",
            "category": "General"
        },
        {
            "name": "v2rayn",
            "desc": "A GUI client for Windows, Linux and macOS, support xrayAUR and sing-boxAUR cores and others.",
            "category": "General"
        },
        {
            "name": "varnish",
            "desc": "High-performance HTTP accelerator.",
            "category": "General"
        },
        {
            "name": "wireproxy",
            "desc": "WireGuard client that exposes itself as a SOCKS5 proxy.",
            "category": "General"
        },
        {
            "name": "gnunet",
            "desc": "Framework for secure peer-to-peer networking.",
            "category": "General"
        },
        {
            "name": "i2p",
            "desc": "Distributed anonymous network.",
            "category": "General"
        },
        {
            "name": "tor",
            "desc": "Anonymizing overlay network.",
            "category": "General"
        },
        {
            "name": "isatapd",
            "desc": "Creates and maintains an ISATAP tunnel (RFC:5214).",
            "category": "General"
        },
        {
            "name": "cloak",
            "desc": "A pluggable transport that works alongside traditional proxy tools like OpenVPN, written in Go.",
            "category": "General"
        },
        {
            "name": "browsh",
            "desc": "A fully-modern text-based browser. Runs as a frontend to headless Firefox.",
            "category": "General"
        },
        {
            "name": "elinks",
            "desc": "Advanced and well-established feature-rich text mode web browser with mouse wheel scroll support, frames and tables, extensible with Lua & Guile (link",
            "category": "General"
        },
        {
            "name": "links",
            "desc": "Graphics and text mode web browser. Includes a console version similar to Lynx.",
            "category": "General"
        },
        {
            "name": "lynx",
            "desc": "Text browser for the World Wide Web.",
            "category": "General"
        },
        {
            "name": "w3m",
            "desc": "Pager/text-based web browser. It has vim-like keybindings, and is able to display images.",
            "category": "General"
        },
        {
            "name": "firefox",
            "desc": "Extensible browser from Mozilla based on Gecko with fast rendering.",
            "category": "General"
        },
        {
            "name": "seamonkey",
            "desc": "Continuation of the Mozilla Internet Suite.",
            "category": "General"
        },
        {
            "name": "floorp",
            "desc": "Firefox-based browser with excellent privacy protection, developed by a community of students in Japan.",
            "category": "General"
        },
        {
            "name": "gnu icecat",
            "desc": "A customized build of Firefox ESR distributed by the GNU Project, stripped of non-free components and with additional privacy extensions. Release cycl",
            "category": "General"
        },
        {
            "name": "librewolf",
            "desc": "A fork of Firefox, focused on privacy, security and freedom.",
            "category": "General"
        },
        {
            "name": "midori",
            "desc": "Light, fast and secure browser.",
            "category": "General"
        },
        {
            "name": "mullvad browser",
            "desc": "Privacy-focused web browser developed by Mullvad VPN and the Tor Project based on Firefox ESR.",
            "category": "General"
        },
        {
            "name": "tor browser launcher",
            "desc": "Securely and easily download, verify, install, and launch Tor Browser, a fork of Firefox ESR.",
            "category": "General"
        },
        {
            "name": "waterfox",
            "desc": "Fork of Mozilla Firefox featuring some privacy, usability, and speed enhancements.",
            "category": "General"
        },
        {
            "name": "zen browser",
            "desc": "An experimental, privacy-focused and performance-optimized fork of Firefox with additional features, such as tab groups and a sidebar.",
            "category": "General"
        },
        {
            "name": "chromium",
            "desc": "Web browser developed by Google, the open source project behind Google Chrome.",
            "category": "General"
        },
        {
            "name": "brave",
            "desc": "Web browser with builtin ad- and tracker blocking.",
            "category": "General"
        },
        {
            "name": "cromite",
            "desc": "Cromite is a Chromium fork based on Bromite (Currently unmaintained) with built-in support for ad blocking and an eye for privacy. See List of feature",
            "category": "General"
        },
        {
            "name": "ungoogled chromium",
            "desc": "Modifications to Google Chromium for removing Google integration and enhancing privacy, control, and transparency",
            "category": "General"
        },
        {
            "name": "google chrome",
            "desc": "Proprietary web browser developed by Google.",
            "category": "General"
        },
        {
            "name": "microsoft edge",
            "desc": "Proprietary web browser developed by Microsoft.",
            "category": "General"
        },
        {
            "name": "opera",
            "desc": "Proprietary browser developed by Opera Software.",
            "category": "General"
        },
        {
            "name": "slimjet",
            "desc": "Fast, smart and powerful proprietary browser based on Chromium.",
            "category": "General"
        },
        {
            "name": "srware iron",
            "desc": "Light-weight proprietary browser based on Chromium.",
            "category": "General"
        },
        {
            "name": "vivaldi",
            "desc": "An advanced proprietary browser made with the power user in mind.",
            "category": "General"
        },
        {
            "name": "yandex browser",
            "desc": "Proprietary browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.",
            "category": "General"
        },
        {
            "name": "angelfish",
            "desc": "Web browser for Plasma Mobile. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "dooble",
            "desc": "Colorful Web browser.",
            "category": "General"
        },
        {
            "name": "eric",
            "desc": "QtWebEngine-based HTML browser, part of the eric6 development toolset, can be launched with the eric6_browser command.",
            "category": "General"
        },
        {
            "name": "falkon",
            "desc": "Web browser based on QtWebEngine, written in Qt framework. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "fiery",
            "desc": "A convergent web browser. Part of maui.",
            "category": "General"
        },
        {
            "name": "konqueror",
            "desc": "Web browser based on Qt toolkit and Qt WebEngine. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "qutebrowser",
            "desc": "A keyboard-driven, vim-like browser based on PyQt5 and QtWebEngine.",
            "category": "General"
        },
        {
            "name": "badwolf",
            "desc": "A minimalist privacy-focused browser.",
            "category": "General"
        },
        {
            "name": "gnome web",
            "desc": "Browser which uses the WebKitGTK rendering engine. Part of gnome.",
            "category": "General"
        },
        {
            "name": "luakit",
            "desc": "Fast, small, webkit based browser framework extensible by Lua.",
            "category": "General"
        },
        {
            "name": "nyxt",
            "desc": "Keyboard-oriented, infinitely extensible browser designed for power users. It has familiar key-bindings (Emacs, VI, CUA) and features fuzzy searching ",
            "category": "General"
        },
        {
            "name": "surf",
            "desc": "Lightweight WebKit-based browser, which follows the suckless philosophy (basically, the browser itself is a single C source file).",
            "category": "General"
        },
        {
            "name": "basilisk",
            "desc": "A XUL-based web browser, similar in design to Firefox, aimed at providing a fully functional browsing experience with a classic interface.",
            "category": "General"
        },
        {
            "name": "pale moon",
            "desc": "A Firefox fork focussing on speed, with a pre-Firefox 29 interface. Uses Goanna layout engine, a fork of Gecko. Firefox add-ons may not be compatible.",
            "category": "General"
        },
        {
            "name": "servo",
            "desc": "Web browser rendering engine written in Rust, with WebGL and WebGPU support, and adaptable to desktop, mobile, and embedded applications.",
            "category": "General"
        },
        {
            "name": "dillo",
            "desc": "Small, fast graphical web browser built on FLTK. Uses its own layout engine.",
            "category": "General"
        },
        {
            "name": "ladybird",
            "desc": "Web browser built from scratch using the SerenityOS LibWeb engine.",
            "category": "General"
        },
        {
            "name": "links",
            "desc": "Graphics and text mode web browser. Includes a graphical X-window/framebuffer version with CSS, image rendering, pull-down menus. It can be launched w",
            "category": "General"
        },
        {
            "name": "netsurf",
            "desc": "Featherweight browser written in C, notable for its slowly developing JavaScript support and fast rendering through its own layout engine.",
            "category": "General"
        },
        {
            "name": "apache http server",
            "desc": "A high performance Unix-based HTTP server.",
            "category": "General"
        },
        {
            "name": "caddy",
            "desc": "HTTP/3 web server with automatic HTTPS.",
            "category": "General"
        },
        {
            "name": "hiawatha",
            "desc": "Secure and advanced web server.",
            "category": "General"
        },
        {
            "name": "lighttpd",
            "desc": "A secure, fast, compliant and very flexible web-server.",
            "category": "General"
        },
        {
            "name": "nginx",
            "desc": "Lightweight HTTP server and IMAP/POP3 proxy server.",
            "category": "General"
        },
        {
            "name": "uwsgi",
            "desc": "A fast, self-healing and developer/sysadmin-friendly application container server written in C.",
            "category": "General"
        },
        {
            "name": "aria2",
            "desc": "Lightweight download utility that supports HTTP/S, FTP, SFTP, BitTorrent and Metalink. It can run as a daemon controlled via a built-in JSON-RPC or XM",
            "category": "General"
        },
        {
            "name": "curl",
            "desc": "A URL retrieval utility and library. Supports HTTP, FTP and SFTP.",
            "category": "General"
        },
        {
            "name": "httrack",
            "desc": "An easy-to-use offline browser utility. It allows you to download a World Wide Web site from the Internet to a local directory, building recursively a",
            "category": "General"
        },
        {
            "name": "lftp",
            "desc": "Sophisticated file transfer program. Supports HTTP, FTP, SFTP, FISH, and BitTorrent.",
            "category": "General"
        },
        {
            "name": "rtmpdump",
            "desc": "Download FLV videos through RTMP (Adobe's proprietary protocol for Flash video players)",
            "category": "General"
        },
        {
            "name": "streamlink",
            "desc": "Launch streams from various streaming services in a custom video player or save them to a file.",
            "category": "General"
        },
        {
            "name": "streamripper",
            "desc": "Records and splits streaming mp3 into tracks.",
            "category": "General"
        },
        {
            "name": "wget",
            "desc": "A network utility to retrieve files from the Web. Supports HTTP and FTP.",
            "category": "General"
        },
        {
            "name": "yt-dlp",
            "desc": "A youtube-dl fork with additional features and fixes.",
            "category": "General"
        },
        {
            "name": "gwget",
            "desc": "Download manager for GNOME. Supports HTTP and FTP.",
            "category": "General"
        },
        {
            "name": "jdownloader",
            "desc": "Java-based downloader for one-click hosting sites.",
            "category": "General"
        },
        {
            "name": "kget",
            "desc": "Download manager for KDE. Supports HTTP, FTP, BitTorrent and Metalink. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "motrix",
            "desc": "Full-featured download manager that supports downloading HTTP, FTP, BitTorrent, Magnet, etc. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "pyload",
            "desc": "Downloader written in Python and designed to be extremely lightweight, easily extensible and fully manageable via web.",
            "category": "General"
        },
        {
            "name": "cozy",
            "desc": "A personal cloud you can hack, host and delete.",
            "category": "General"
        },
        {
            "name": "nextcloud",
            "desc": "A cloud server to store your files centrally on a hardware controlled by you.",
            "category": "General"
        },
        {
            "name": "pydio",
            "desc": "Mature open source web application for file sharing and synchronization.",
            "category": "General"
        },
        {
            "name": "fuse filesystems",
            "desc": "Some  provide a way to mount cloud-storage as a filesystem. Google Drive can be accessed also by gvfs-google for GVFS-based applications (like Nautilu",
            "category": "General"
        },
        {
            "name": "insync",
            "desc": "Unofficial proprietary Google Drive desktop client.",
            "category": "General"
        },
        {
            "name": "cozy drive",
            "desc": "Desktop client for Cozy.",
            "category": "General"
        },
        {
            "name": "dropbox",
            "desc": "Proprietary desktop client for Dropbox.",
            "category": "General"
        },
        {
            "name": "mega sync client",
            "desc": "Proprietary (though source-available) desktop client to sync files with Mega.",
            "category": "General"
        },
        {
            "name": "nextcloud client",
            "desc": "Desktop client for Nextcloud.",
            "category": "General"
        },
        {
            "name": "onedrive",
            "desc": "Fork of the unofficial CLI for OneDrive.",
            "category": "General"
        },
        {
            "name": "owncloud desktop client",
            "desc": "Desktop syncing client for ownCloud.",
            "category": "General"
        },
        {
            "name": "pcloud drive",
            "desc": "Proprietary desktop syncing client for pCloud. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "pydiosync",
            "desc": "Desktop client for Pydio.",
            "category": "General"
        },
        {
            "name": "spideroak one",
            "desc": "Proprietary client for SpiderOak One.",
            "category": "General"
        },
        {
            "name": "synology drive",
            "desc": "Proprietary GUI client to sync and share files between a centralized Synology NAS and multiple client computers.",
            "category": "General"
        },
        {
            "name": "tresorit",
            "desc": "Proprietary desktop syncing client for Tresorit.",
            "category": "General"
        },
        {
            "name": "yandex disk",
            "desc": "Proprietary CLI for Yandex Disk.",
            "category": "General"
        },
        {
            "name": "curlftpfs",
            "desc": "is a filesystem for accessing FTP hosts based on FUSE and libcurl.",
            "category": "General"
        },
        {
            "name": "filezilla",
            "desc": "Fast and reliable FTP, FTPS and SFTP client.",
            "category": "General"
        },
        {
            "name": "tnftp",
            "desc": "FTP client with several advanced features for NetBSD.",
            "category": "General"
        },
        {
            "name": "pure-ftpd",
            "desc": "Free (BSD-licensed), secure, production-quality and standard-compliant FTP server.",
            "category": "General"
        },
        {
            "name": "vsftpd",
            "desc": "Lightweight, stable and secure FTP server for UNIX-like systems.",
            "category": "General"
        },
        {
            "name": "deluge",
            "desc": "BitTorrent client with multiple user interfaces in a client/server model. This package includes a console client.",
            "category": "General"
        },
        {
            "name": "rtorrent",
            "desc": "Simple and lightweight ncurses BitTorrent client.",
            "category": "General"
        },
        {
            "name": "transmission cli",
            "desc": "Simple and easy-to-use BitTorrent client with a daemon version and multiple front-ends. This package includes backend, daemon, command-line interface,",
            "category": "General"
        },
        {
            "name": "deluge (gtk interface)",
            "desc": "User-friendly BitTorrent client written in Python using GTK.",
            "category": "General"
        },
        {
            "name": "frostwire",
            "desc": "Easy to use cloud downloader, BitTorrent client and media player.",
            "category": "General"
        },
        {
            "name": "ktorrent",
            "desc": "Feature-rich BitTorrent client for KDE. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "powder player",
            "desc": "Hybrid between a streaming BitTorrent client and a player. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "qbittorrent",
            "desc": "Open source (GPLv2) BitTorrent client with an integrated torrent search engine that strongly resembles µTorrent.",
            "category": "General"
        },
        {
            "name": "tixati",
            "desc": "Proprietary peer-to-peer file sharing program that uses the popular BitTorrent protocol.",
            "category": "General"
        },
        {
            "name": "transmission",
            "desc": "Simple and easy-to-use BitTorrent client with a daemon version and multiple front-ends.",
            "category": "General"
        },
        {
            "name": "transmission remote",
            "desc": "GTK client for remote management of the Transmission BitTorrent client, using its HTTP RPC protocol.",
            "category": "General"
        },
        {
            "name": "tribler",
            "desc": "4th generation file sharing system BitTorrent client.",
            "category": "General"
        },
        {
            "name": "vuze",
            "desc": "Feature-rich BitTorrent client written in Java (formerly Azureus).",
            "category": "General"
        },
        {
            "name": "webtorrent desktop",
            "desc": "Streaming BitTorrent application. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "amule",
            "desc": "Well-known eDonkey/Kad client with a daemon version and GTK, web, and CLI front-ends.",
            "category": "General"
        },
        {
            "name": "gtk-gnutella",
            "desc": "GTK server/client for the Gnutella peer-to-peer network.",
            "category": "General"
        },
        {
            "name": "ipfs",
            "desc": "IPFS is a P2P Network capable of sharing and receiving files.",
            "category": "General"
        },
        {
            "name": "lbry",
            "desc": "Browser and wallet for LBRY, the decentralized, user-controlled content marketplace. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "mldonkey",
            "desc": "Multi-protocol P2P client that supports HTTP, FTP, BitTorrent, Direct Connect, eDonkey and FastTrack.",
            "category": "General"
        },
        {
            "name": "send anywhere",
            "desc": "Proprietary file sharing service where users can directly share digital content in real time. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "0x0.st",
            "desc": "is a file hosting service. Usage examples are:",
            "category": "General"
        },
        {
            "name": "paste.c-net.org",
            "desc": "accepts HTTP requests and works with nc.",
            "category": "General"
        },
        {
            "name": "termbin.com",
            "desc": "works with nc.",
            "category": "General"
        },
        {
            "name": "fb-client",
            "desc": "Client for the paste.xinu.at pastebin.",
            "category": "General"
        },
        {
            "name": "gist",
            "desc": "Command-line interface for the gist.github.com pastebin service.",
            "category": "General"
        },
        {
            "name": "imgur",
            "desc": "A CLI client which can upload image to imgur.com image sharing service.",
            "category": "General"
        },
        {
            "name": "ruby-haste",
            "desc": "Client for hastebin.com.",
            "category": "General"
        },
        {
            "name": "aerc",
            "desc": "Work in progress asynchronous email client.",
            "category": "General"
        },
        {
            "name": "alot",
            "desc": "An experimental terminal MUA based on notmuch mail. It is written in python using the urwid toolkit.",
            "category": "General"
        },
        {
            "name": "alpine",
            "desc": "Fast, easy-to-use and Apache-licensed email client based on Pine.",
            "category": "General"
        },
        {
            "name": "mutt",
            "desc": "Small but very powerful text-based mail client.",
            "category": "General"
        },
        {
            "name": "neomutt",
            "desc": "Command line mail reader (or MUA). It is a fork of Mutt with added features.",
            "category": "General"
        },
        {
            "name": "nmh",
            "desc": "A modular mail handling system.",
            "category": "General"
        },
        {
            "name": "notmuch",
            "desc": "A fast mail indexer built on top of xapian.",
            "category": "General"
        },
        {
            "name": "s-nail",
            "desc": "a mail processing system with a command syntax reminiscent of ed with lines replaced by messages. Provides the functionality of mailx.",
            "category": "General"
        },
        {
            "name": "sup",
            "desc": "CLI mail client with very fast searching, tagging, threading and GMail like operation.",
            "category": "General"
        },
        {
            "name": "claws mail",
            "desc": "Lightweight GTK-based email client and news reader.",
            "category": "General"
        },
        {
            "name": "electronmail",
            "desc": "Unofficial desktop application for several end-to-end encrypted email providers (like ProtonMail, Tutanota). Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "evolution",
            "desc": "Mature and feature-rich e-mail client that is part of the GNOME project. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "geary",
            "desc": "Simple desktop mail client built in Vala. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "kmail",
            "desc": "Mature and feature-rich email client. Part of kde-pim.",
            "category": "General"
        },
        {
            "name": "mailspring",
            "desc": "Fork of Nylas Mail by one of the original authors. The paid \"Pro\" version requires a Mailspring ID and has extra features like snooze, send later. Bas",
            "category": "General"
        },
        {
            "name": "seamonkey mail & newsgroups",
            "desc": "Email client included in the SeaMonkey suite.",
            "category": "General"
        },
        {
            "name": "thunderbird",
            "desc": "Feature-rich email client from Mozilla written in GTK.",
            "category": "General"
        },
        {
            "name": "tutanota",
            "desc": "Email client for Tutanota mail service. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "nextcloud mail",
            "desc": "An email webapp for NextCloud.",
            "category": "General"
        },
        {
            "name": "roundcube",
            "desc": "Browser-based multilingual IMAP client webapp with a native application-like user interface.",
            "category": "General"
        },
        {
            "name": "fdm",
            "desc": "Program to fetch and deliver mail.",
            "category": "General"
        },
        {
            "name": "fetchmail",
            "desc": "A remote-mail retrieval utility.",
            "category": "General"
        },
        {
            "name": "getmail",
            "desc": "A POP3/IMAP4 mail retriever with reliable Maildir and command delivery.",
            "category": "General"
        },
        {
            "name": "isync",
            "desc": "IMAP and MailDir mailbox synchronizer",
            "category": "General"
        },
        {
            "name": "offlineimap",
            "desc": "Synchronizes emails between two repositories.",
            "category": "General"
        },
        {
            "name": "bitlbee",
            "desc": "IRC gateway to popular chat networks.",
            "category": "General"
        },
        {
            "name": "weechat",
            "desc": "Modular, lightweight ncurses-based IRC client. A variety of other protocols are supported through plugins.",
            "category": "General"
        },
        {
            "name": "jitsi",
            "desc": "Audio/video VoIP phone and instant messenger written in Java that supports protocols such as SIP, XMPP, IRC and many other useful features.",
            "category": "General"
        },
        {
            "name": "pidgin",
            "desc": "Multi-protocol instant messaging client with audio support that uses libpurple and supports all its protocols (Bonjour, Gadu-Gadu, Groupwise, IRC, SIM",
            "category": "General"
        },
        {
            "name": "smuxi",
            "desc": "Cross-platform IRC client that also supports XMPP.",
            "category": "General"
        },
        {
            "name": "thunderbird",
            "desc": "Feature-rich email client supports instant messaging and chat using IRC and XMPP.",
            "category": "General"
        },
        {
            "name": "bitchx",
            "desc": "Console-based IRC client developed from the popular ircII.",
            "category": "General"
        },
        {
            "name": "erc",
            "desc": "Powerful, modular and extensible IRC client for Emacs.",
            "category": "General"
        },
        {
            "name": "ii",
            "desc": "Featherweight IRC client, literally tail -f the conversation and echo back your replies to a file.",
            "category": "General"
        },
        {
            "name": "irssi",
            "desc": "Highly-configurable ncurses-based IRC client.",
            "category": "General"
        },
        {
            "name": "scrollz",
            "desc": "Advanced IRC client based on ircII.",
            "category": "General"
        },
        {
            "name": "senpai",
            "desc": "An IRC client that works best with bouncers (e.g. soju): no logs are kept, history is fetched from the server via CHATHISTORY, networks are fetched fr",
            "category": "General"
        },
        {
            "name": "sic",
            "desc": "Extremely simple IRC client, similar to ii.",
            "category": "General"
        },
        {
            "name": "chatzilla",
            "desc": "Clean, easy to use and highly extensible Internet Relay Chat (IRC) client, built on the Mozilla platform using XULRunner. Included in the SeaMonkey su",
            "category": "General"
        },
        {
            "name": "hexchat",
            "desc": "Fork of XChat for Linux and Windows.",
            "category": "General"
        },
        {
            "name": "konversation",
            "desc": "Qt-based IRC client for the KDE desktop. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "kvirc",
            "desc": "Qt-based IRC client featuring extensive themes support.",
            "category": "General"
        },
        {
            "name": "polari",
            "desc": "Simple IRC client by the GNOME project. Part of gnome-extra.",
            "category": "General"
        },
        {
            "name": "quassel",
            "desc": "Modern, cross-platform, distributed IRC client.",
            "category": "General"
        },
        {
            "name": "jabber.el",
            "desc": "Minimal XMPP client for Emacs.",
            "category": "General"
        },
        {
            "name": "gajim",
            "desc": "XMPP client with audio support written in Python using GTK.",
            "category": "General"
        },
        {
            "name": "psi",
            "desc": "Qt-based XMPP client.",
            "category": "General"
        },
        {
            "name": "spark",
            "desc": "Cross-platform real-time XMPP collaboration client optimized for business and organizations.",
            "category": "General"
        },
        {
            "name": "tkabber",
            "desc": "Easy to hack feature-rich XMPP client by the author of the ejabberd XMPP server.",
            "category": "General"
        },
        {
            "name": "blink",
            "desc": "State of the art, easy to use SIP client.",
            "category": "General"
        },
        {
            "name": "linphone",
            "desc": "VoIP phone application (SIP client) for communicating freely with people over the internet, with voice, video, and text instant messaging.",
            "category": "General"
        },
        {
            "name": "twinkle",
            "desc": "Qt softphone for VoIP and IM communication using SIP.",
            "category": "General"
        },
        {
            "name": "cinny",
            "desc": "Cinny is a matrix client focusing primarily on simple, elegant and secure interface. The desktop app is made with Tauri.",
            "category": "General"
        },
        {
            "name": "element",
            "desc": "Glossy Matrix client with an emphasis on performance and usability. Web application and desktop application based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "gomuks",
            "desc": "Terminal Matrix client written in Go using mautrix and mauview.",
            "category": "General"
        },
        {
            "name": "neochat",
            "desc": "KDE client for the Matrix protocol. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "schildichat",
            "desc": "Matrix client based on Element with a more traditional instant messaging experience. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "briar",
            "desc": "Briar is a messaging application designed for activists, journalists, and anyone else who needs a safe, easy and robust way to communicate.",
            "category": "General"
        },
        {
            "name": "patchwork",
            "desc": "Decentralized messaging and sharing application built on top of Secure Scuttlebutt (SSB). Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "ricochet",
            "desc": "Anonymous peer-to-peer instant messaging system built on Tor hidden services.",
            "category": "General"
        },
        {
            "name": "caprine",
            "desc": "Unofficial Facebook Messenger app. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "delta chat",
            "desc": "A privacy oriented chat application built on e-mail. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "discord",
            "desc": "Proprietary all-in-one voice and text chat application for gamers that’s free and works on both your desktop and phone. Based on the Electron platform",
            "category": "General"
        },
        {
            "name": "gitter",
            "desc": "Communication product for communities and teams on GitLab and GitHub.",
            "category": "General"
        },
        {
            "name": "jitsi meet",
            "desc": "Desktop application for Jitsi Meet. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "mattermost desktop",
            "desc": "Desktop application for Mattermost. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "mumble",
            "desc": "Voice chat application similar to TeamSpeak.",
            "category": "General"
        },
        {
            "name": "qq",
            "desc": "Proprietary instant messaging software developed by Tencent (imitating ICQ).",
            "category": "General"
        },
        {
            "name": "rocket.chat desktop",
            "desc": "Desktop application for Rocket.Chat. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "session desktop",
            "desc": "Onion routing based messenger. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "signal desktop",
            "desc": "Desktop application for Signal private messenger. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "slack",
            "desc": "Proprietary Slack client for desktop. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "teams-for-linux",
            "desc": "Unofficial Microsoft Teams for Linux client. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "teamspeak",
            "desc": "Proprietary VoIP application with gamers as its target audience.",
            "category": "General"
        },
        {
            "name": "teamtalk",
            "desc": "Proprietary VoIP application with video chat, file and desktop sharing.  Desktop sharing does not appear to be working in Linux though.  AUR package i",
            "category": "General"
        },
        {
            "name": "telegram desktop",
            "desc": "Official Telegram desktop client.",
            "category": "General"
        },
        {
            "name": "viber",
            "desc": "Proprietary cross-platform IM and VoIP software.",
            "category": "General"
        },
        {
            "name": "wechat",
            "desc": "Tencent WeChat Client.",
            "category": "General"
        },
        {
            "name": "wire",
            "desc": "Modern, private messenger. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "zoom",
            "desc": "Proprietary video conferencing, online meetings and group messaging application.",
            "category": "General"
        },
        {
            "name": "zulip",
            "desc": "Desktop client for Zulip group chat. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "inspircd",
            "desc": "A stable, modern and lightweight IRC daemon.",
            "category": "General"
        },
        {
            "name": "unrealircd",
            "desc": "Open Source IRC Server.",
            "category": "General"
        },
        {
            "name": "openfire",
            "desc": "An XMPP IM multiplatform server written in Java",
            "category": "General"
        },
        {
            "name": "prosody",
            "desc": "An XMPP server written in the Lua programming language. Prosody is designed to be lightweight and highly extensible. It is licensed under a permissive",
            "category": "General"
        },
        {
            "name": "asterisk",
            "desc": "A complete PBX solution.",
            "category": "General"
        },
        {
            "name": "yate",
            "desc": "Advanced, mature, flexible telephony server that is used for VoIP and fixed networks, and for traditional mobile operators and MVNOs.",
            "category": "General"
        },
        {
            "name": "mattermost",
            "desc": "Open source private cloud server, Slack-alternative.",
            "category": "General"
        },
        {
            "name": "murmur",
            "desc": "The voice chat application server for Mumble.",
            "category": "General"
        },
        {
            "name": "synapse",
            "desc": "Reference homeserver for the Matrix protocol.",
            "category": "General"
        },
        {
            "name": "teamspeak server",
            "desc": "Proprietary VoIP conference server.",
            "category": "General"
        },
        {
            "name": "sogo",
            "desc": "Groupware server built around OpenGroupware.org (OGo) and the SOPE application server.",
            "category": "General"
        },
        {
            "name": "canto",
            "desc": "Ncurses RSS aggregator.",
            "category": "General"
        },
        {
            "name": "feed2imap-go",
            "desc": "feed2imap reimplemented in Go that aggregating RSS/Atom/jsonfeed into folders of your IMAP mailbox.",
            "category": "General"
        },
        {
            "name": "gnus",
            "desc": "Email, NNTP and RSS client for Emacs.",
            "category": "General"
        },
        {
            "name": "newsboat",
            "desc": "Ncurses RSS aggregator with layout and keybinding similar to the Mutt email client.",
            "category": "General"
        },
        {
            "name": "newsraft",
            "desc": "Feed reader with ncurses user interface.  It is greatly inspired by Newsboat and tries to be its lightweight counterpart.",
            "category": "General"
        },
        {
            "name": "akregator",
            "desc": "News aggregator for KDE, part of kde-pim.",
            "category": "General"
        },
        {
            "name": "alligator",
            "desc": "Kirigami-based RSS/Atom feed reader for mobile devices. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "fluent reader",
            "desc": "Modern desktop RSS reader built with React and Fluent UI. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "liferea",
            "desc": "GTK news aggregator for online news feeds and weblogs.",
            "category": "General"
        },
        {
            "name": "raven",
            "desc": "Simple desktop RSS reader made using VueJS. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "nextcloud news",
            "desc": "RSS/Atom feed reader for Nextcloud.",
            "category": "General"
        },
        {
            "name": "tiny tiny rss",
            "desc": "Web-based news feed (RSS/Atom) aggregator.",
            "category": "General"
        },
        {
            "name": "kasts",
            "desc": "Convergent podcast application that looks good on desktop and mobile. Part of kde-multimedia.",
            "category": "General"
        },
        {
            "name": "slrn",
            "desc": "Text-based news client.",
            "category": "General"
        },
        {
            "name": "tin",
            "desc": "A cross-platform threaded NNTP and spool based UseNet newsreader.",
            "category": "General"
        },
        {
            "name": "nzbget",
            "desc": "Usenet binary downloader for .nzb files with web and CLI interface.",
            "category": "General"
        },
        {
            "name": "pan",
            "desc": "GTK Usenet newsreader that's good at both text and binaries.",
            "category": "General"
        },
        {
            "name": "sabnzbd",
            "desc": "An open-source binary newsreader webapp written in Python.",
            "category": "General"
        },
        {
            "name": "tokodon",
            "desc": "Mastodon client for KDE. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "whalebird",
            "desc": "Mastodon client application. Based on the Electron platform.",
            "category": "General"
        },
        {
            "name": "diaspora",
            "desc": "A distributed privacy aware social network.",
            "category": "General"
        },
        {
            "name": "drupal",
            "desc": "A PHP-based content management platform.",
            "category": "General"
        },
        {
            "name": "joomla",
            "desc": "A php Content Management System (CMS) which enables you to build websites and powerful online applications.",
            "category": "General"
        },
        {
            "name": "wordpress",
            "desc": "Blog tool and publishing platform.",
            "category": "General"
        },
        {
            "name": "anydesk",
            "desc": "Proprietary remote desktop software.",
            "category": "General"
        },
        {
            "name": "gnome connections",
            "desc": "Remote desktop client for GNOME. Supports RDP and VNC. Part of gnome.",
            "category": "General"
        },
        {
            "name": "krdc",
            "desc": "Remote Desktop Client for KDE. Supports RDP and VNC. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "remmina",
            "desc": "Remote desktop client written in GTK. Supports RDP, VNC, SPICE, X2Go and SSH.",
            "category": "General"
        },
        {
            "name": "teamviewer",
            "desc": "Proprietary remote desktop client. It uses its own proprietary protocol.",
            "category": "General"
        },
        {
            "name": "vinagre",
            "desc": "Remote desktop viewer for GNOME. Supports RDP, VNC, SPICE and SSH.",
            "category": "General"
        },
        {
            "name": "vncviewer (tigervnc)",
            "desc": "VNC viewer for X.",
            "category": "General"
        },
        {
            "name": "x2go client",
            "desc": "A graphical client (Qt5) for the X2Go system that uses the NX technology protocol.",
            "category": "General"
        },
        {
            "name": "krfb",
            "desc": "VNC server for KDE. Part of kde-network.",
            "category": "General"
        },
        {
            "name": "nomachine",
            "desc": "Proprietary remote desktop server and client based on NX \ntechnology.",
            "category": "General"
        },
        {
            "name": "wayvnc",
            "desc": "VNC server for wlroots based wayland compositors (such as sway).",
            "category": "General"
        },
        {
            "name": "x0vncserver (tigervnc)",
            "desc": "VNC Server for X displays.",
            "category": "General"
        },
        {
            "name": "x11vnc",
            "desc": "VNC server for real X displays.",
            "category": "General"
        },
        {
            "name": "x2go server",
            "desc": "An open source remote desktop software that uses the NX technology protocol.",
            "category": "General"
        },
        {
            "name": "xpra",
            "desc": "A multi-platform screen and application forwarding system.",
            "category": "General"
        },
        {
            "name": "xrdp",
            "desc": "A daemon that supports RDP. It uses Xvnc, X11rdp or xorgxrdp as a backend.",
            "category": "General"
        }
    ]
}